STMicroelectronics/STM32_open_pin_data/boards/M33_Evaluation_Board_STM32MP257F-EV1_STM32MP257FAI_Board_AllConfig.ioc
DDR_CTRL_PHY.UIB_NUMANIB_REG=\#define DDR_UIB_NUMANIB 0x00000008
DDR_CTRL_PHY.UIB_NUMDBYTE_REG=\#define DDR_UIB_NUMDBYTE 0x00000004
DDR_CTRL_PHY.UIB_NUMPSTATES_REG=\#define DDR_UIB_NUMPSTATES 0x00000001
DDR_CTRL_PHY.UIB_NUMRANK_DFI0_REG=\#define DDR_UIB_NUMRANK_DFI0 0x00000001
DDR_CTRL_PHY.UIB_NUMRANK_DFI1_REG=\#define DDR_UIB_NUMRANK_DFI1 0x00000001
DDR_CTRL_PHY.UIB_PLLBYPASS_0_REG=\#define DDR_UIB_PLLBYPASS_0 0x00000000
DDR_CTRL_PHY.UIB_READDBIENABLE_0_REG=\#define DDR_UIB_READDBIENABLE_0 0x00000000
DDR_CTRL_PHY.UIB_TRAIN2D_REG=\#define DDR_UIB_TRAIN2D 0x00000000
DDR_CTRL_PHY.UIM_MR0_0_REG=\#define DDR_UIM_MR0_0 0x00000940
DDR_CTRL_PHY.UIM_MR11_0_REG=\#define DDR_UIM_MR11_0 0x00000000
DDR_CTRL_PHY.UIM_MR12_0_REG=\#define DDR_UIM_MR12_0 0x00000000
DDR_CTRL_PHY.UIM_MR13_0_REG=\#define DDR_UIM_MR13_0 0x00000000
DDR_CTRL_PHY.UIM_MR14_0_REG=\#define DDR_UIM_MR14_0 0x00000000
DDR_CTRL_PHY.UIM_MR1_0_REG=\#define DDR_UIM_MR1_0 0x00000103
DDR_CTRL_PHY.UIM_MR22_0_REG=\#define DDR_UIM_MR22_0 0x00000000
DDR_CTRL_PHY.UIM_MR2_0_REG=\#define DDR_UIM_MR2_0 0x00000018
DDR_CTRL_PHY.UIM_MR3_0_REG=\#define DDR_UIM_MR3_0 0x00000000
DDR_CTRL_PHY.UIM_MR4_0_REG=\#define DDR_UIM_MR4_0 0x00000008
DDR_CTRL_PHY.UIM_MR5_0_REG=\#define DDR_UIM_MR5_0 0x00000460
DDR_CTRL_PHY.UIM_MR6_0_REG=\#define DDR_UIM_MR6_0 0x00000c16
DDR_CTRL_PHY.UIS_SWIZZLE_0_REG=\#define DDR_UIS_SWIZZLE_0 0x0000000c
DDR_CTRL_PHY.UIS_SWIZZLE_10_REG=\#define DDR_UIS_SWIZZLE_10 0x0000000a
DDR_CTRL_PHY.UIS_SWIZZLE_11_REG=\#define DDR_UIS_SWIZZLE_11 0x0000000d
DDR_CTRL_PHY.UIS_SWIZZLE_12_REG=\#define DDR_UIS_SWIZZLE_12 0x00000014
DDR_CTRL_PHY.UIS_SWIZZLE_13_REG=\#define DDR_UIS_SWIZZLE_13 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_14_REG=\#define DDR_UIS_SWIZZLE_14 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_15_REG=\#define DDR_UIS_SWIZZLE_15 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_16_REG=\#define DDR_UIS_SWIZZLE_16 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_17_REG=\#define DDR_UIS_SWIZZLE_17 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_18_REG=\#define DDR_UIS_SWIZZLE_18 0x00000006
DDR_CTRL_PHY.UIS_SWIZZLE_19_REG=\#define DDR_UIS_SWIZZLE_19 0x0000000b
DDR_CTRL_PHY.UIS_SWIZZLE_1_REG=\#define DDR_UIS_SWIZZLE_1 0x00000005
DDR_CTRL_PHY.UIS_SWIZZLE_20_REG=\#define DDR_UIS_SWIZZLE_20 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_21_REG=\#define DDR_UIS_SWIZZLE_21 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_22_REG=\#define DDR_UIS_SWIZZLE_22 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_23_REG=\#define DDR_UIS_SWIZZLE_23 0x00000008
DDR_CTRL_PHY.UIS_SWIZZLE_24_REG=\#define DDR_UIS_SWIZZLE_24 0x00000002
DDR_CTRL_PHY.UIS_SWIZZLE_25_REG=\#define DDR_UIS_SWIZZLE_25 0x00000018
DDR_CTRL_PHY.UIS_SWIZZLE_26_REG=\#define DDR_UIS_SWIZZLE_26 0x1a13050c
DDR_CTRL_PHY.UIS_SWIZZLE_27_REG=\#define DDR_UIS_SWIZZLE_27 0x19010309
DDR_CTRL_PHY.UIS_SWIZZLE_28_REG=\#define DDR_UIS_SWIZZLE_28 0x0d0a0407
DDR_CTRL_PHY.UIS_SWIZZLE_29_REG=\#define DDR_UIS_SWIZZLE_29 0x00000014
DDR_CTRL_PHY.UIS_SWIZZLE_2_REG=\#define DDR_UIS_SWIZZLE_2 0x00000013
DDR_CTRL_PHY.UIS_SWIZZLE_30_REG=\#define DDR_UIS_SWIZZLE_30 0x000b0600
DDR_CTRL_PHY.UIS_SWIZZLE_31_REG=\#define DDR_UIS_SWIZZLE_31 0x02080000
DDR_CTRL_PHY.UIS_SWIZZLE_32_REG=\#define DDR_UIS_SWIZZLE_32 0x00000018
DDR_CTRL_PHY.UIS_SWIZZLE_33_REG=\#define DDR_UIS_SWIZZLE_33 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_34_REG=\#define DDR_UIS_SWIZZLE_34 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_35_REG=\#define DDR_UIS_SWIZZLE_35 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_36_REG=\#define DDR_UIS_SWIZZLE_36 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_37_REG=\#define DDR_UIS_SWIZZLE_37 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_38_REG=\#define DDR_UIS_SWIZZLE_38 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_39_REG=\#define DDR_UIS_SWIZZLE_39 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_3_REG=\#define DDR_UIS_SWIZZLE_3 0x0000001a
DDR_CTRL_PHY.UIS_SWIZZLE_40_REG=\#define DDR_UIS_SWIZZLE_40 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_41_REG=\#define DDR_UIS_SWIZZLE_41 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_42_REG=\#define DDR_UIS_SWIZZLE_42 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_43_REG=\#define DDR_UIS_SWIZZLE_43 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_4_REG=\#define DDR_UIS_SWIZZLE_4 0x00000009
DDR_CTRL_PHY.UIS_SWIZZLE_5_REG=\#define DDR_UIS_SWIZZLE_5 0x00000003
DDR_CTRL_PHY.UIS_SWIZZLE_6_REG=\#define DDR_UIS_SWIZZLE_6 0x00000001
DDR_CTRL_PHY.UIS_SWIZZLE_7_REG=\#define DDR_UIS_SWIZZLE_7 0x00000019
DDR_CTRL_PHY.UIS_SWIZZLE_8_REG=\#define DDR_UIS_SWIZZLE_8 0x00000007
DDR_CTRL_PHY.UIS_SWIZZLE_9_REG=\#define DDR_UIS_SWIZZLE_9 0x00000004
DDR_CTRL_PHY.VREF\ (%)=0.7
DDR_CTRL_PHY.ZQCTL0_REG=\#define DDR_ZQCTL0 0x01000040
DDR_CTRL_PHY.ZQCTL1_REG=\#define DDR_ZQCTL1 0x2000493e
DDR_CTRL_PHY.ZQCTL2_REG=\#define DDR_ZQCTL2 0x00000000
DDR_CTRL_PHY.device_width=16
DDR_CTRL_PHY.phyvref=0.7376237623762376
DDR_CTRL_PHY.tDLLK=1024
DDR_CTRL_PHY.tRC=50
DDR_CTRL_PHY.tRFC1=550
DDR_CTRL_PHY.tRFC2=350
DDR_CTRL_PHY.tRFC4=260
ETH1.IPParameters=MediaInterface
ETH1.MediaInterface=HAL_ETH_RMII_MODE
ETH2.IPParameters=MediaInterface
ETH2.MediaInterface=HAL_ETH_RMII_MODE
File.Version=6
GIC.ETH1_LPI_IRQn=true\:false\:High level
GIC.ETH1_PMT_IRQn=true\:false\:High level
GIC.ETH1_SBD_IRQn=true\:false\:High level
GIC.HASH_IRQn=true\:false\:High level
GIC.I2C2_IRQn=true\:false\:High level
GIC.I2C7_IRQn=true\:false\:High level
GIC.IPCC1_RX_IRQn=true\:false\:High level
GIC.IPCC1_TX_IRQn=true\:false\:High level
GIC.LPTIM1_IRQn=true\:false\:High level
GIC.LTDC_IRQn=true\:false\:High level
GIC.OCTOSPI2_IRQn=true\:false\:High level
GIC.RCC_IRQn=true\:false\:High level
GIC.RCC_WAKEUP_IRQn=true\:false\:High level
GIC.RTC_IRQn=true\:false\:High level
GIC.RTC_S_IRQn=true\:false\:High level
GIC.SDMMC1_IRQn=true\:false\:High level
GIC.TIM8_BRK_IRQn=true\:false\:High level
GIC.TIM8_CC_IRQn=true\:false\:High level
GIC.TIM8_TRG_COM_IRQn=true\:false\:High level
GIC.TIM8_UP_IRQn=true\:false\:High level
GIC.USART2_IRQn=true\:false\:High level
GPIO.groupedBy=Group By Peripherals
I2C1.IPParameters=Timing
I2C1.Timing=0x10C0ECFF
I2C2.IPParameters=Timing
I2C2.Timing=0x10C0ECFF
I2C7.IPParameters=Timing
I2C7.Timing=0x307075B1
KeepUserPlacement=true
LVDS_D0N.GPIOParameters=PinAttribute
LVDS_D0N.Locked=true
LVDS_D0N.Mode=Single_Link
LVDS_D0N.PinAttribute=CortexA35NSOS
LVDS_D0N.Signal=LVDS_D0N
LVDS_D0P.GPIOParameters=PinAttribute
LVDS_D0P.Locked=true
LVDS_D0P.Mode=Single_Link
LVDS_D0P.PinAttribute=CortexA35NSOS
LVDS_D0P.Signal=LVDS_D0P
LVDS_D1N.GPIOParameters=PinAttribute
LVDS_D1N.Locked=true
LVDS_D1N.Mode=Single_Link
LVDS_D1N.PinAttribute=CortexA35NSOS
LVDS_D1N.Signal=LVDS_D1N
LVDS_D1P.GPIOParameters=PinAttribute
LVDS_D1P.Locked=true
LVDS_D1P.Mode=Single_Link
LVDS_D1P.PinAttribute=CortexA35NSOS
LVDS_D1P.Signal=LVDS_D1P
Mcu.CPN=STM32MP257FAI3
Mcu.Context0=BootROMA35
Mcu.Context1=CortexA35SFSBLA
Mcu.Context2=CortexA35SSecureOS
Mcu.Context3=CortexA35NSSSBL
Mcu.Context4=CortexA35NSOS
Mcu.Context5=CortexM33SSecureOS
Mcu.Context6=CortexM33NS
Mcu.ContextNb=7
Mcu.ContextProject=A35TD_TZEN
Mcu.Family=STM32MP2
Mcu.IP0=ADC3
Mcu.IP1=BSEC
Mcu.IP10=GPU
Mcu.IP11=HASH
Mcu.IP12=I2C1
Mcu.IP13=I2C2
Mcu.IP14=I2C7
Mcu.IP15=ICACHE
Mcu.IP16=IPCC1
Mcu.IP17=IWDG1
Mcu.IP18=LPTIM1
Mcu.IP19=LTDC
Mcu.IP2=CORTEX_M33
Mcu.IP20=LVDS
Mcu.IP21=NVIC2
Mcu.IP22=OCTOSPI2
Mcu.IP23=OCTOSPIM
Mcu.IP24=PCIE
Mcu.IP25=PKA
Mcu.IP26=PWR
Mcu.IP27=RCC
Mcu.IP28=RIF
Mcu.IP29=RNG
Mcu.IP3=CRYP1
Mcu.IP30=RTC
Mcu.IP31=SAES
Mcu.IP32=SDMMC1
Mcu.IP33=SERC
Mcu.IP34=STGEN
Mcu.IP35=SYS
Mcu.IP36=SYS_S
Mcu.IP37=TIM8
Mcu.IP38=UART5
Mcu.IP39=UCPD1
Mcu.IP4=CSI
Mcu.IP40=USART2
Mcu.IP41=USART6
Mcu.IP42=USB3DR
Mcu.IP43=USBH_HS
Mcu.IP44=VDEC
Mcu.IP45=VENC
Mcu.IP5=DCMIPP
Mcu.IP6=DDR_CTRL_PHY
Mcu.IP7=ETH1
Mcu.IP8=ETH2
Mcu.IP9=GIC
Mcu.IPNb=46
Mcu.Name=STM32MP257FAIx
Mcu.Package=TFBGA436
Mcu.Pin0=LVDS_D1P
Mcu.Pin1=LVDS_D1N
Mcu.Pin10=PB5
Mcu.Pin100=UCPD1_CC1
Mcu.Pin101=UCPD1_CC2
Mcu.Pin102=PJ6
Mcu.Pin103=PC9
Mcu.Pin104=PC5
Mcu.Pin105=PA14
Mcu.Pin106=PH10
Mcu.Pin107=PA12
Mcu.Pin108=PA10
Mcu.Pin109=PH8
Mcu.Pin11=PD9
Mcu.Pin110=PJ0
Mcu.Pin111=OSC_OUT
Mcu.Pin112=OSC_IN
Mcu.Pin113=PJ5
Mcu.Pin114=PC8
Mcu.Pin115=PC4
Mcu.Pin116=PF2
Mcu.Pin117=PC1
Mcu.Pin118=PF0
Mcu.Pin119=PH2
Mcu.Pin12=PD5
Mcu.Pin120=PA6
Mcu.Pin121=PA1
Mcu.Pin122=USBH_HS_TXRTUNE
Mcu.Pin123=USB3DR_TXRTUNE
Mcu.Pin124=PJ7
Mcu.Pin125=PJ4
Mcu.Pin126=PG3
Mcu.Pin127=PG1
Mcu.Pin128=PG0
Mcu.Pin129=PC3
Mcu.Pin13=PE1
Mcu.Pin130=PF3
Mcu.Pin131=PF1
Mcu.Pin132=PA11
Mcu.Pin133=PA2
Mcu.Pin134=PH3
Mcu.Pin135=PA8
Mcu.Pin136=USB3DR_DP
Mcu.Pin137=PA0
Mcu.Pin138=PJ1
Mcu.Pin139=PG2
Mcu.Pin14=PE4
Mcu.Pin140=PF11
Mcu.Pin141=PC12
Mcu.Pin142=PC7
Mcu.Pin143=PF5
Mcu.Pin144=PF4
Mcu.Pin145=PC2
Mcu.Pin146=PA13
Mcu.Pin147=PA5
Mcu.Pin148=PA7
Mcu.Pin149=PA4
Mcu.Pin15=PB12
Mcu.Pin150=USB3DR_DM
Mcu.Pin151=PCIE_CLKINP
Mcu.Pin152=COMBOPHY_REXT
Mcu.Pin153=PJ3
Mcu.Pin154=PG4
Mcu.Pin155=PF10
Mcu.Pin156=PF9
Mcu.Pin157=PF8
Mcu.Pin158=PC6
Mcu.Pin159=PH12
Mcu.Pin16=PD13
Mcu.Pin160=PC0
Mcu.Pin161=PH6
Mcu.Pin162=PH5
Mcu.Pin163=USBH_HS_DP
Mcu.Pin164=PCIE_CLKINN
Mcu.Pin165=COMBOPHY_TX1P
Mcu.Pin166=COMBOPHY_RX1P
Mcu.Pin167=PJ2
Mcu.Pin168=PB15
Mcu.Pin169=PC11
Mcu.Pin17=CSI_D0P
Mcu.Pin170=PF6
Mcu.Pin171=PH13
Mcu.Pin172=PH9
Mcu.Pin173=PH4
Mcu.Pin174=USBH_HS_DM
Mcu.Pin175=COMBOPHY_TX1N
Mcu.Pin176=COMBOPHY_RX1N
Mcu.Pin177=VP_BSEC_VS_BSEC
Mcu.Pin178=VP_CORTEX_M33_VS_CORTEX_M33
Mcu.Pin179=VP_CRYP1_VS_CRYP
Mcu.Pin18=CSI_CKP
Mcu.Pin180=VP_DCMIPP_VS_PIPE0
Mcu.Pin181=VP_DCMIPP_CSI
Mcu.Pin182=VP_DDR_CTRL_PHY_DDR4
Mcu.Pin183=VP_DDR_CTRL_PHY_VS_32BITS
Mcu.Pin184=VP_DDR_CTRL_PHY_VS_16Gb
Mcu.Pin185=VP_GPU_VS_GPU
Mcu.Pin186=VP_HASH_VS_HASH
Mcu.Pin187=VP_ICACHE_VS_SECURE_ICACHE_REG
Mcu.Pin188=VP_IPCC1_VS_IPCC
Mcu.Pin189=VP_IWDG1_VS_IWDG
Mcu.Pin19=PD8
Mcu.Pin190=VP_LPTIM1_VS_LPTIM_counterModeInternalClock
Mcu.Pin191=VP_LTDC_DSIMode
Mcu.Pin192=VP_OCTOSPI2_VS_dual
Mcu.Pin193=VP_OCTOSPIM_VS_IO
Mcu.Pin194=VP_PKA_VS_PKA
Mcu.Pin195=VP_PWR_V_PVD_IN
Mcu.Pin196=VP_RNG_VS_RNG
Mcu.Pin197=VP_RTC_VS_RTC_Activate
Mcu.Pin198=VP_RTC_VS_RTC_Calendar
Mcu.Pin199=VP_RTC_VS_RTC_WakeUp_intern
Mcu.Pin2=LVDS_D0P
Mcu.Pin20=PD4
Mcu.Pin200=VP_SAES_VS_SAES
Mcu.Pin201=VP_SERC_VS_SERC
Mcu.Pin202=VP_STGEN_VS_STGEN
Mcu.Pin203=VP_SYS_VS_Systick
Mcu.Pin204=VP_SYS_S_VS_Systick
Mcu.Pin205=VP_VDEC_VS_VDEC
Mcu.Pin206=VP_VENC_VS_VENC
Mcu.Pin21=PD3
Mcu.Pin22=PE2
Mcu.Pin23=PE5
Mcu.Pin24=PB14
Mcu.Pin25=CSI_CKN
Mcu.Pin26=CSI_D1P
Mcu.Pin27=PB4
Mcu.Pin28=PB1
Mcu.Pin29=PB7
Mcu.Pin3=PB10
Mcu.Pin30=PD10
Mcu.Pin31=PD0
Mcu.Pin32=PD7
Mcu.Pin33=PE3
Mcu.Pin34=PE7
Mcu.Pin35=PE9
Mcu.Pin36=PB13
Mcu.Pin37=CSI_REXT
Mcu.Pin38=CSI_D1N
Mcu.Pin39=PB3
Mcu.Pin4=PD6
Mcu.Pin40=PI15
Mcu.Pin41=PD11
Mcu.Pin42=PE6
Mcu.Pin43=PI11
Mcu.Pin44=PK4
Mcu.Pin45=PK0
Mcu.Pin46=PK2
Mcu.Pin47=PK3
Mcu.Pin48=PD15
Mcu.Pin49=PI12
Mcu.Pin5=PE0
Mcu.Pin50=PI13
Mcu.Pin51=PG9
Mcu.Pin52=PG14
Mcu.Pin53=PI0
Mcu.Pin54=PB8
Mcu.Pin55=PK7
Mcu.Pin56=PD14
Mcu.Pin57=PI10
Mcu.Pin58=PF14
Mcu.Pin59=PG6
Mcu.Pin6=PE10
Mcu.Pin60=PG10
Mcu.Pin61=PG15
Mcu.Pin62=PI5
Mcu.Pin63=PI1
Mcu.Pin64=PG12
Mcu.Pin65=PG11
Mcu.Pin66=PI3
Mcu.Pin67=PI6
Mcu.Pin68=PJ15
Mcu.Pin69=PG7
Mcu.Pin7=PD12
Mcu.Pin70=PG13
Mcu.Pin71=PI4
Mcu.Pin72=PI9
Mcu.Pin73=PG5
Mcu.Pin74=PJ12
Mcu.Pin75=PJ14
Mcu.Pin76=PF13
Mcu.Pin77=PG8
Mcu.Pin78=PI7
Mcu.Pin79=PF15
Mcu.Pin8=LVDS_D0N
Mcu.Pin80=PJ9
Mcu.Pin81=PJ8
Mcu.Pin82=PJ13
Mcu.Pin83=PJ11
Mcu.Pin84=PI8
Mcu.Pin85=PZ9
Mcu.Pin86=PZ0
Mcu.Pin87=PZ1
Mcu.Pin88=PZ2
Mcu.Pin89=PZ5
Mcu.Pin9=CSI_D0N
Mcu.Pin90=OSC32_IN
Mcu.Pin91=OSC32_OUT
Mcu.Pin92=PZ6
Mcu.Pin93=PC10
Mcu.Pin94=PF7
Mcu.Pin95=PA15
Mcu.Pin96=PH11
Mcu.Pin97=PA9
Mcu.Pin98=PH7
Mcu.Pin99=PA3
Mcu.PinsNb=207
Mcu.ThirdPartyNb=0
Mcu.UserConstants=
Mcu.UserName=STM32MP257FAIx
MxCube.Version=6.12.0
MxDb.Version=DB.6.0.120
NVIC2.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.ForceEnableDMAVector=true
NVIC2.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC2.RCC_WAKEUP_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC2.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.SecureFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true\:false
NVIC2.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
OSC32_IN.GPIOParameters=PinAttribute
OSC32_IN.Locked=true
OSC32_IN.Mode=LSE-External-Clock-Source
OSC32_IN.PinAttribute=
OSC32_IN.Signal=RCC_OSC32_IN
OSC32_OUT.GPIOParameters=PinAttribute
OSC32_OUT.Locked=true
OSC32_OUT.Mode=LSE-External-Clock-Source
OSC32_OUT.PinAttribute=
OSC32_OUT.Signal=RCC_OSC32_OUT
OSC_IN.GPIOParameters=PinAttribute
OSC_IN.Locked=true
OSC_IN.Mode=HSE-External-Clock-Source
OSC_IN.PinAttribute=
OSC_IN.Signal=RCC_OSC_IN
OSC_OUT.GPIOParameters=PinAttribute
OSC_OUT.Locked=true
OSC_OUT.Mode=HSE-External-Clock-Source
OSC_OUT.PinAttribute=
OSC_OUT.Signal=RCC_OSC_OUT
PA0.GPIOParameters=PinAttribute
PA0.Locked=true
PA0.Mode=WakeUp1
PA0.PinAttribute=CortexA35SFSBLA,CortexA35SSecureOS
PA0.Signal=PWR_WKUP1
PA1.ContextOwner=CortexA35NSOS
PA1.GPIOParameters=PinAttribute
PA1.Locked=true
PA1.PinAttribute=CortexA35NSOS
PA1.Signal=GPIO_Output
PA10.ContextOwner=CortexA35NSOS
PA10.GPIOParameters=PinAttribute
PA10.Locked=true
PA10.PinAttribute=CortexA35NSOS
PA10.Signal=GPIO_Input
PA11.GPIOParameters=PinAttribute
PA11.Locked=true
PA11.Mode=RGMII (Reduced GMII)
PA11.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PA11.Signal=ETH1_RGMII_RX_CTL
PA12.ContextOwner=CortexA35NSOS
PA12.GPIOParameters=PinAttribute
PA12.Locked=true
PA12.PinAttribute=CortexA35NSOS
PA12.Signal=GPIO_Input
PA13.GPIOParameters=PinAttribute
PA13.Locked=true
PA13.Mode=RGMII (Reduced GMII)
PA13.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PA13.Signal=ETH1_RGMII_TX_CTL
PA14.GPIOParameters=PinAttribute
PA14.Locked=true
PA14.Mode=RGMII (Reduced GMII)
PA14.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PA14.Signal=ETH1_RGMII_RX_CLK
PA15.GPIOParameters=PinAttribute
PA15.Locked=true
PA15.Mode=RGMII (Reduced GMII)
PA15.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PA15.Signal=ETH1_RGMII_TXD0
PA2.ContextOwner=CortexA35NSOS
PA2.GPIOParameters=PinAttribute
PA2.Locked=true
PA2.PinAttribute=CortexA35NSOS
PA2.Signal=GPIO_Output
PA3.ContextOwner=CortexA35NSOS
PA3.GPIOParameters=PinAttribute
PA3.Locked=true
PA3.PinAttribute=CortexA35NSOS
PA3.Signal=GPIO_Input
PA4.GPIOParameters=PinAttribute
PA4.Locked=true
PA4.Mode=Asynchronous
PA4.PinAttribute=CortexA35SFSBLA,CortexA35NSSSBL,CortexA35NSOS
PA4.Signal=USART2_TX
PA5.ContextOwner=CortexA35NSOS
PA5.GPIOParameters=PinAttribute
PA5.Locked=true
PA5.PinAttribute=CortexA35NSOS
PA5.Signal=GPIO_Input
PA6.ContextOwner=CortexA35NSOS
PA6.GPIOParameters=PinAttribute
PA6.Locked=true
PA6.PinAttribute=CortexA35NSOS
PA6.Signal=GPIO_Input
PA7.ContextOwner=CortexA35NSOS
PA7.GPIOParameters=PinAttribute
PA7.Locked=true
PA7.PinAttribute=CortexA35NSOS
PA7.Signal=GPIO_Input
PA8.GPIOParameters=PinAttribute
PA8.Locked=true
PA8.Mode=Asynchronous
PA8.PinAttribute=CortexA35SFSBLA,CortexA35NSSSBL,CortexA35NSOS
PA8.Signal=USART2_RX
PA9.ContextOwner=CortexA35NSOS
PA9.GPIOParameters=PinAttribute
PA9.Locked=true
PA9.PinAttribute=CortexA35NSOS
PA9.Signal=GPIO_Input
PB1.ContextOwner=CortexA35NSOS
PB1.GPIOParameters=PinAttribute
PB1.Locked=true
PB1.PinAttribute=CortexA35NSOS
PB1.Signal=GPIO_Input
PB10.ContextOwner=CortexA35NSOS
PB10.GPIOParameters=PinAttribute
PB10.Locked=true
PB10.PinAttribute=CortexA35NSOS
PB10.Signal=GPIO_Input
PB12.ContextOwner=CortexA35NSOS
PB12.GPIOParameters=PinAttribute
PB12.Locked=true
PB12.PinAttribute=CortexA35NSOS
PB12.Signal=GPIO_Input
PB13.ContextOwner=CortexA35NSOS
PB13.GPIOParameters=PinAttribute
PB13.Locked=true
PB13.PinAttribute=CortexA35NSOS
PB13.Signal=GPIO_Input
PB14.ContextOwner=CortexA35NSOS
PB14.GPIOParameters=PinAttribute
PB14.Locked=true
PB14.PinAttribute=CortexA35NSOS
PB14.Signal=GPIO_Input
PB15.ContextOwner=CortexA35NSOS
PB15.GPIOParameters=PinAttribute
PB15.Locked=true
PB15.PinAttribute=CortexA35NSOS
PB15.Signal=GPIO_Input
PB3.ContextOwner=CortexA35NSOS
PB3.GPIOParameters=PinAttribute
PB3.Locked=true
PB3.PinAttribute=CortexA35NSOS
PB3.Signal=GPIO_Input
PB4.GPIOParameters=PinAttribute
PB4.Locked=true
PB4.Mode=I2C
PB4.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PB4.Signal=I2C2_SDA
PB5.GPIOParameters=PinAttribute
PB5.Locked=true
PB5.Mode=I2C
PB5.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PB5.Signal=I2C2_SCL
PB7.ContextOwner=CortexA35NSOS
PB7.GPIOParameters=PinAttribute
PB7.Locked=true
PB7.PinAttribute=CortexA35NSOS
PB7.Signal=GPIO_Input
PB8.GPIOParameters=PinAttribute
PB8.Locked=true
PB8.PinAttribute=Free
PB8.Signal=GPIO_Input
PC0.GPIOParameters=PinAttribute
PC0.Locked=true
PC0.Mode=RGMII (Reduced GMII)
PC0.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PC0.Signal=ETH1_RGMII_GTX_CLK
PC1.GPIOParameters=PinAttribute
PC1.Locked=true
PC1.Mode=RGMII (Reduced GMII)
PC1.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PC1.Signal=ETH1_RGMII_TXD1
PC10.GPIOParameters=PinAttribute
PC10.Locked=true
PC10.Mode=RGMII (Reduced GMII)
PC10.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PC10.Signal=ETH2_RGMII_TXD3
PC11.GPIOParameters=PinAttribute
PC11.Locked=true
PC11.Mode=RGMII (Reduced GMII)
PC11.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PC11.Signal=ETH2_RGMII_RXD3
PC12.GPIOParameters=PinAttribute
PC12.Locked=true
PC12.Mode=RGMII (Reduced GMII)
PC12.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PC12.Signal=ETH2_RGMII_RXD1
PC2.GPIOParameters=PinAttribute
PC2.Locked=true
PC2.Mode=RGMII (Reduced GMII)
PC2.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PC2.Signal=ETH1_RGMII_RXD1
PC3.GPIOParameters=PinAttribute
PC3.Locked=true
PC3.Mode=RGMII (Reduced GMII)
PC3.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PC3.Signal=ETH2_RGMII_RX_CTL
PC4.GPIOParameters=PinAttribute
PC4.Locked=true
PC4.Mode=RGMII (Reduced GMII)
PC4.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PC4.Signal=ETH2_RGMII_TX_CTL
PC5.GPIOParameters=PinAttribute
PC5.Locked=true
PC5.Mode=RGMII (Reduced GMII)
PC5.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
