STMicroelectronics/STM32_open_pin_data/boards/M33_Evaluation_Board_STM32MP257F-EV1_STM32MP257FAI_Board_AllConfig.ioc
PC5.Signal=ETH2_MDIO
PC6.GPIOParameters=PinAttribute
PC6.Locked=true
PC6.Mode=RGMII (Reduced GMII)
PC6.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PC6.Signal=ETH2_MDC
PC7.GPIOParameters=PinAttribute
PC7.Locked=true
PC7.Mode=RGMII (Reduced GMII)
PC7.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PC7.Signal=ETH2_RGMII_TXD0
PC8.GPIOParameters=PinAttribute
PC8.Locked=true
PC8.Mode=RGMII (Reduced GMII)
PC8.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PC8.Signal=ETH2_RGMII_TXD1
PC9.GPIOParameters=PinAttribute
PC9.Locked=true
PC9.Mode=RGMII (Reduced GMII)
PC9.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PC9.Signal=ETH2_RGMII_TXD2
PCIE_CLKINN.GPIOParameters=PinAttribute
PCIE_CLKINN.Mode=Root_Complex_External
PCIE_CLKINN.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PCIE_CLKINN.Signal=PCIE_CLKINN
PCIE_CLKINP.GPIOParameters=PinAttribute
PCIE_CLKINP.Mode=Root_Complex_External
PCIE_CLKINP.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PCIE_CLKINP.Signal=PCIE_CLKINP
PD0.GPIOParameters=PinAttribute
PD0.Locked=true
PD0.Mode=OCTOSPI2_Port1Single
PD0.PinAttribute=CortexA35SSecureOS
PD0.Signal=OCTOSPIM_P1_CLK
PD10.ContextOwner=CortexA35NSOS
PD10.GPIOParameters=PinAttribute
PD10.Locked=true
PD10.PinAttribute=CortexA35NSOS
PD10.Signal=GPIO_Input
PD11.ContextOwner=CortexA35NSOS
PD11.GPIOParameters=PinAttribute
PD11.Locked=true
PD11.PinAttribute=CortexA35NSOS
PD11.Signal=GPIO_Input
PD12.ContextOwner=CortexA35NSOS
PD12.GPIOParameters=PinAttribute
PD12.Locked=true
PD12.PinAttribute=CortexA35NSOS
PD12.Signal=GPIO_Input
PD13.ContextOwner=CortexA35NSOS
PD13.GPIOParameters=PinAttribute
PD13.Locked=true
PD13.PinAttribute=CortexA35NSOS
PD13.Signal=GPXTI13
PD14.GPIOParameters=PinAttribute
PD14.Locked=true
PD14.Mode=I2C
PD14.PinAttribute=CortexA35SFSBLA,CortexA35SSecureOS
PD14.Signal=I2C7_SDA
PD15.GPIOParameters=PinAttribute
PD15.Locked=true
PD15.Mode=I2C
PD15.PinAttribute=CortexA35SFSBLA,CortexA35SSecureOS
PD15.Signal=I2C7_SCL
PD3.GPIOParameters=PinAttribute
PD3.Locked=true
PD3.Mode=OCTOSPI2_Port1_NCS1
PD3.PinAttribute=CortexA35SSecureOS
PD3.Signal=OCTOSPIM_P1_NCS1
PD4.GPIOParameters=PinAttribute
PD4.Locked=true
PD4.Mode=OCTOSPI2_Port1Single
PD4.PinAttribute=CortexA35SSecureOS
PD4.Signal=OCTOSPIM_P1_IO0
PD5.GPIOParameters=PinAttribute
PD5.Locked=true
PD5.Mode=OCTOSPI2_Port1Single
PD5.PinAttribute=CortexA35SSecureOS
PD5.Signal=OCTOSPIM_P1_IO1
PD6.ContextOwner=CortexA35SSecureOS
PD6.GPIOParameters=PinAttribute
PD6.Locked=true
PD6.PinAttribute=CortexA35SSecureOS
PD6.Signal=GPIO_Input
PD7.ContextOwner=CortexA35SSecureOS
PD7.GPIOParameters=PinAttribute
PD7.Locked=true
PD7.PinAttribute=CortexA35SSecureOS
PD7.Signal=GPIO_Input
PD8.ContextOwner=CortexA35NSOS
PD8.GPIOParameters=PinAttribute
PD8.Locked=true
PD8.PinAttribute=CortexA35NSOS
PD8.Signal=GPIO_Input
PD9.ContextOwner=CortexA35NSOS
PD9.GPIOParameters=PinAttribute
PD9.Locked=true
PD9.PinAttribute=CortexA35NSOS
PD9.Signal=GPIO_Input
PE0.GPIOParameters=PinAttribute
PE0.Locked=true
PE0.Mode=SD_4_bits_Wide_bus
PE0.PinAttribute=BootROMA35,CortexA35SFSBLA,CortexA35NSSSBL,CortexA35NSOS
PE0.Signal=SDMMC1_D2
PE1.GPIOParameters=PinAttribute
PE1.Locked=true
PE1.Mode=SD_4_bits_Wide_bus
PE1.PinAttribute=BootROMA35,CortexA35SFSBLA,CortexA35NSSSBL,CortexA35NSOS
PE1.Signal=SDMMC1_D3
PE10.ContextOwner=CortexA35NSOS
PE10.GPIOParameters=PinAttribute
PE10.Locked=true
PE10.PinAttribute=CortexA35NSOS
PE10.Signal=GPIO_Input
PE2.GPIOParameters=PinAttribute
PE2.Locked=true
PE2.Mode=SD_4_bits_Wide_bus
PE2.PinAttribute=BootROMA35,CortexA35SFSBLA,CortexA35NSSSBL,CortexA35NSOS
PE2.Signal=SDMMC1_CMD
PE3.GPIOParameters=PinAttribute
PE3.Locked=true
PE3.Mode=SD_4_bits_Wide_bus
PE3.PinAttribute=BootROMA35,CortexA35SFSBLA,CortexA35NSSSBL,CortexA35NSOS
PE3.Signal=SDMMC1_CK
PE4.GPIOParameters=PinAttribute
PE4.Locked=true
PE4.Mode=SD_4_bits_Wide_bus
PE4.PinAttribute=BootROMA35,CortexA35SFSBLA,CortexA35NSSSBL,CortexA35NSOS
PE4.Signal=SDMMC1_D0
PE5.GPIOParameters=PinAttribute
PE5.Locked=true
PE5.Mode=SD_4_bits_Wide_bus
PE5.PinAttribute=BootROMA35,CortexA35SFSBLA,CortexA35NSSSBL,CortexA35NSOS
PE5.Signal=SDMMC1_D1
PE6.ContextOwner=CortexA35NSOS
PE6.GPIOParameters=PinAttribute
PE6.Locked=true
PE6.PinAttribute=CortexA35NSOS
PE6.Signal=GPIO_Input
PE7.ContextOwner=CortexA35NSOS
PE7.GPIOParameters=PinAttribute
PE7.Locked=true
PE7.PinAttribute=CortexA35NSOS
PE7.Signal=GPIO_Input
PE9.ContextOwner=CortexA35NSOS
PE9.GPIOParameters=PinAttribute
PE9.Locked=true
PE9.PinAttribute=CortexA35NSOS
PE9.Signal=GPIO_Input
PF0.GPIOParameters=PinAttribute
PF0.Locked=true
PF0.Mode=RGMII (Reduced GMII)
PF0.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PF0.Signal=ETH1_MDC
PF1.GPIOParameters=PinAttribute
PF1.Locked=true
PF1.Mode=RGMII (Reduced GMII)
PF1.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PF1.Signal=ETH1_RGMII_RXD0
PF10.GPIOParameters=PinAttribute
PF10.Locked=true
PF10.Mode=IN2-Differential
PF10.PinAttribute=CortexM33NS
PF10.Signal=ADC3_INP2
PF11.GPIOParameters=PinAttribute
PF11.Mode=IN2-Differential
PF11.PinAttribute=CortexM33NS
PF11.Signal=ADC3_INN2
PF13.GPIOParameters=PinAttribute
PF13.Locked=true
PF13.Mode=Asynchronous
PF13.PinAttribute=CortexM33SSecureOS
PF13.Signal=USART6_TX
PF14.GPIOParameters=PinAttribute
PF14.Locked=true
PF14.Mode=Asynchronous
PF14.PinAttribute=CortexM33SSecureOS
PF14.Signal=USART6_RX
PF15.ContextOwner=CortexM33NS
PF15.GPIOParameters=PinAttribute
PF15.Locked=true
PF15.PinAttribute=CortexM33NS
PF15.Signal=GPIO_Input
PF2.GPIOParameters=PinAttribute
PF2.Locked=true
PF2.Mode=RGMII (Reduced GMII)
PF2.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PF2.Signal=ETH1_MDIO
PF3.ContextOwner=CortexA35NSOS
PF3.GPIOParameters=PinAttribute
PF3.Locked=true
PF3.PinAttribute=CortexA35NSOS
PF3.Signal=GPIO_Input
PF4.ContextOwner=CortexA35NSOS
PF4.GPIOParameters=PinAttribute
PF4.Locked=true
PF4.PinAttribute=CortexA35NSOS
PF4.Signal=GPIO_Input
PF5.ContextOwner=CortexA35NSOS
PF5.GPIOParameters=PinAttribute
PF5.Locked=true
PF5.PinAttribute=CortexA35NSOS
PF5.Signal=GPIO_Input
PF6.GPIOParameters=PinAttribute
PF6.Locked=true
PF6.Mode=RGMII (Reduced GMII)
PF6.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PF6.Signal=ETH2_RGMII_RX_CLK
PF7.GPIOParameters=PinAttribute
PF7.Locked=true
PF7.Mode=RGMII (Reduced GMII)
PF7.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PF7.Signal=ETH2_RGMII_GTX_CLK
PF8.GPIOParameters=PinAttribute
PF8.Locked=true
PF8.Mode=ETH 125MHz Clock Input
PF8.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PF8.Signal=ETH2_RGMII_CLK125
PF9.GPIOParameters=PinAttribute
PF9.Locked=true
PF9.Mode=RGMII (Reduced GMII)
PF9.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PF9.Signal=ETH2_RGMII_RXD2
PG0.GPIOParameters=PinAttribute
PG0.Locked=true
PG0.Mode=RGMII (Reduced GMII)
PG0.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PG0.Signal=ETH2_RGMII_RXD0
PG1.GPIOParameters=PinAttribute
PG1.Locked=true
PG1.Mode=WakeUp3
PG1.PinAttribute=CortexA35SFSBLA,CortexA35SSecureOS
PG1.Signal=PWR_WKUP3
PG10.GPIOParameters=PinAttribute
PG10.Locked=true
PG10.Mode=Asynchronous
PG10.PinAttribute=CortexM33SSecureOS
PG10.Signal=UART5_RX
PG11.ContextOwner=CortexA35NSOS
PG11.GPIOParameters=PinAttribute
PG11.Locked=true
PG11.PinAttribute=CortexA35NSOS
PG11.Signal=GPIO_Input
PG12.ContextOwner=CortexA35NSOS
PG12.GPIOParameters=PinAttribute
PG12.Locked=true
PG12.PinAttribute=CortexA35NSOS
PG12.Signal=GPIO_Input
PG13.GPIOParameters=PinAttribute
PG13.Locked=true
PG13.Mode=I2C
PG13.PinAttribute=CortexM33NS
PG13.Signal=I2C1_SCL
PG14.ContextOwner=CortexA35NSOS
PG14.GPIOParameters=PinAttribute
PG14.Locked=true
PG14.PinAttribute=CortexA35NSOS
PG14.Signal=GPIO_Input
PG15.ContextOwner=CortexA35NSOS
PG15.GPIOParameters=PinAttribute
PG15.Locked=true
PG15.PinAttribute=CortexA35NSOS
PG15.Signal=GPIO_Input
PG2.GPIOParameters=PinAttribute
PG2.Locked=true
PG2.Mode=WakeUp5
PG2.PinAttribute=CortexA35SFSBLA,CortexA35SSecureOS
PG2.Signal=PWR_WKUP5
PG3.GPIOParameters=PinAttribute
PG3.Locked=true
PG3.Mode=WakeUp6
PG3.PinAttribute=CortexA35SFSBLA,CortexA35SSecureOS
PG3.Signal=PWR_WKUP6
PG4.ContextOwner=CortexA35NSOS
PG4.GPIOParameters=PinAttribute
PG4.Locked=true
PG4.PinAttribute=CortexA35NSOS
PG4.Signal=GPIO_Input
PG5.ContextOwner=CortexA35NSOS
PG5.GPIOParameters=PinAttribute
PG5.Locked=true
PG5.PinAttribute=CortexA35NSOS
PG5.Signal=GPIO_Input
PG6.ContextOwner=CortexA35NSOS
PG6.GPIOParameters=PinAttribute
PG6.Locked=true
PG6.PinAttribute=CortexA35NSOS
PG6.Signal=GPIO_Input
PG7.ContextOwner=CortexA35NSOS
PG7.GPIOParameters=PinAttribute
PG7.Locked=true
PG7.PinAttribute=CortexA35NSOS
PG7.Signal=GPIO_Input
PG8.ContextOwner=CortexA35NSOS
PG8.GPIOParameters=PinAttribute
PG8.Locked=true
PG8.PinAttribute=CortexA35NSOS
PG8.Signal=GPIO_Input
PG9.GPIOParameters=PinAttribute
PG9.Locked=true
PG9.Mode=Asynchronous
PG9.PinAttribute=CortexM33SSecureOS
PG9.Signal=UART5_TX
PH10.GPIOParameters=PinAttribute
PH10.Locked=true
PH10.Mode=RGMII (Reduced GMII)
PH10.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PH10.Signal=ETH1_RGMII_TXD2
PH11.GPIOParameters=PinAttribute
PH11.Locked=true
PH11.Mode=RGMII (Reduced GMII)
PH11.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PH11.Signal=ETH1_RGMII_TXD3
PH12.GPIOParameters=PinAttribute
PH12.Locked=true
PH12.Mode=RGMII (Reduced GMII)
PH12.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PH12.Signal=ETH1_RGMII_RXD2
PH13.GPIOParameters=PinAttribute
PH13.Locked=true
PH13.Mode=RGMII (Reduced GMII)
PH13.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PH13.Signal=ETH1_RGMII_RXD3
PH2.ContextOwner=CortexA35NSOS
PH2.GPIOParameters=PinAttribute
PH2.Locked=true
PH2.PinAttribute=CortexA35NSOS
PH2.Signal=GPIO_Input
PH3.ContextOwner=CortexA35NSOS
PH3.GPIOParameters=PinAttribute
PH3.Locked=true
PH3.PinAttribute=CortexA35NSOS
PH3.Signal=GPIO_Input
PH4.ContextOwner=CortexA35NSOS
PH4.GPIOParameters=PinAttribute
PH4.Locked=true
PH4.PinAttribute=CortexA35NSOS
PH4.Signal=GPIO_Input
PH5.GPIOParameters=PinAttribute
PH5.Locked=true
PH5.Mode=WakeUp2
PH5.PinAttribute=CortexA35SFSBLA,CortexA35SSecureOS
PH5.Signal=PWR_WKUP2
PH6.ContextOwner=CortexA35NSOS
PH6.GPIOParameters=PinAttribute
PH6.Locked=true
PH6.PinAttribute=CortexA35NSOS
PH6.Signal=GPIO_Input
PH7.ContextOwner=CortexA35NSOS
PH7.GPIOParameters=PinAttribute
PH7.Locked=true
PH7.PinAttribute=CortexA35NSOS
PH7.Signal=GPIO_Input
PH8.ContextOwner=CortexA35NSOS
PH8.GPIOParameters=PinAttribute
PH8.Locked=true
PH8.PinAttribute=CortexA35NSOS
PH8.Signal=GPIO_Input
PH9.GPIOParameters=PinAttribute
PH9.Locked=true
PH9.Mode=ETH 125MHz Clock Input
PH9.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PH9.Signal=ETH1_RGMII_CLK125
PI0.ContextOwner=CortexA35NSOS
PI0.GPIOParameters=PinAttribute
PI0.Locked=true
PI0.PinAttribute=CortexA35NSOS
PI0.Signal=GPIO_Input
PI1.GPIOParameters=PinAttribute
PI1.Locked=true
PI1.Mode=I2C
PI1.PinAttribute=CortexM33NS
PI1.Signal=I2C1_SDA
PI10.ContextOwner=CortexA35NSOS
PI10.GPIOParameters=PinAttribute
PI10.Locked=true
PI10.PinAttribute=CortexA35NSOS
PI10.Signal=GPIO_Input
PI11.ContextOwner=CortexA35NSOS
PI11.GPIOParameters=PinAttribute
PI11.Locked=true
PI11.PinAttribute=CortexA35NSOS
PI11.Signal=GPIO_Input
PI12.ContextOwner=CortexA35NSOS
PI12.GPIOParameters=PinAttribute
PI12.Locked=true
PI12.PinAttribute=CortexA35NSOS
PI12.Signal=GPIO_Input
PI13.ContextOwner=CortexA35NSOS
PI13.GPIOParameters=PinAttribute
PI13.Locked=true
PI13.PinAttribute=CortexA35NSOS
PI13.Signal=GPIO_Input
PI15.GPIOParameters=PinAttribute
PI15.Locked=true
PI15.PinAttribute=Free
PI15.Signal=GPIO_Input
PI3.ContextOwner=CortexA35NSOS
PI3.GPIOParameters=PinAttribute
PI3.Locked=true
PI3.PinAttribute=CortexA35NSOS
PI3.Signal=GPXTI3
PI4.ContextOwner=CortexA35NSOS
PI4.GPIOParameters=PinAttribute
PI4.Locked=true
PI4.PinAttribute=CortexA35NSOS
PI4.Signal=GPIO_Input
PI5.ContextOwner=CortexA35NSOS
PI5.GPIOParameters=PinAttribute
PI5.Locked=true
PI5.PinAttribute=CortexA35NSOS
PI5.Signal=GPIO_Input
PI6.GPIOParameters=PinAttribute
PI6.Locked=true
PI6.Mode=WakeUp4
PI6.PinAttribute=CortexA35SFSBLA,CortexA35SSecureOS
PI6.Signal=PWR_WKUP4
PI7.ContextOwner=CortexA35NSOS
PI7.GPIOParameters=PinAttribute
PI7.Locked=true
PI7.PinAttribute=CortexA35NSOS
PI7.Signal=GPIO_Input
PI8.ContextOwner=CortexA35SSecureOS
PI8.GPIOParameters=PinAttribute
PI8.Locked=true
PI8.PinAttribute=CortexA35SSecureOS
PI8.Signal=GPIO_Input
PI9.ContextOwner=CortexA35NSOS
PI9.GPIOParameters=PinAttribute
PI9.Locked=true
PI9.PinAttribute=CortexA35NSOS
PI9.Signal=GPIO_Input
PJ0.GPIOParameters=PinAttribute
PJ0.Locked=true
PJ0.Mode=Enable
PJ0.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PJ0.Signal=PCIE_CLKREQN
PJ1.ContextOwner=CortexA35NSOS
PJ1.GPIOParameters=PinAttribute
PJ1.Locked=true
PJ1.PinAttribute=CortexA35NSOS
PJ1.Signal=GPIO_Input
PJ11.ContextOwner=CortexA35NSOS
PJ11.GPIOParameters=PinAttribute
PJ11.Locked=true
PJ11.PinAttribute=CortexA35NSOS
PJ11.Signal=GPIO_Input
PJ12.ContextOwner=CortexA35NSOS
PJ12.GPIOParameters=PinAttribute
PJ12.Locked=true
PJ12.PinAttribute=CortexA35NSOS
PJ12.Signal=GPIO_Input
PJ13.ContextOwner=CortexA35NSOS
PJ13.GPIOParameters=PinAttribute
PJ13.Locked=true
PJ13.PinAttribute=CortexA35NSOS
PJ13.Signal=GPIO_Input
PJ14.ContextOwner=CortexA35NSOS
PJ14.GPIOParameters=PinAttribute
PJ14.Locked=true
PJ14.PinAttribute=CortexA35NSOS
PJ14.Signal=GPIO_Input
PJ15.ContextOwner=CortexA35NSOS
PJ15.GPIOParameters=PinAttribute
PJ15.Locked=true
PJ15.PinAttribute=CortexA35NSOS
PJ15.Signal=GPIO_Input
PJ2.ContextOwner=CortexA35NSOS
PJ2.GPIOParameters=PinAttribute
PJ2.Locked=true
PJ2.PinAttribute=CortexA35NSOS
PJ2.Signal=GPIO_Input
PJ3.ContextOwner=CortexA35NSOS
PJ3.GPIOParameters=PinAttribute
PJ3.Locked=true
PJ3.PinAttribute=CortexA35NSOS
PJ3.Signal=GPIO_Input
PJ4.GPIOParameters=PinAttribute
PJ4.Locked=true
PJ4.PinAttribute=CortexA35NSOS
PJ4.Signal=S_TIM8_CH4
PJ5.GPIOParameters=PinAttribute
PJ5.Locked=true
PJ5.PinAttribute=CortexA35NSOS
PJ5.Signal=S_TIM8_CH1
PJ6.ContextOwner=CortexM33NS
PJ6.GPIOParameters=PinAttribute
PJ6.Locked=true
PJ6.PinAttribute=CortexM33NS
PJ6.Signal=GPIO_Input
PJ7.ContextOwner=CortexA35NSOS
PJ7.GPIOParameters=PinAttribute
PJ7.Locked=true
PJ7.PinAttribute=CortexA35NSOS
PJ7.Signal=GPIO_Input
PJ8.ContextOwner=CortexM33NS
PJ8.GPIOParameters=PinAttribute
PJ8.Locked=true
PJ8.PinAttribute=CortexM33NS
PJ8.Signal=GPXTI8
PJ9.ContextOwner=CortexA35NSOS
PJ9.GPIOParameters=PinAttribute
PJ9.Locked=true
PJ9.PinAttribute=CortexA35NSOS
PJ9.Signal=GPIO_Input
PK0.ContextOwner=CortexA35NSOS
PK0.GPIOParameters=PinAttribute
PK0.Locked=true
PK0.PinAttribute=CortexA35NSOS
PK0.Signal=GPIO_Input
PK2.GPIOParameters=PinAttribute
PK2.Locked=true
PK2.PinAttribute=Free
PK2.Signal=GPXTI2
PK3.ContextOwner=CortexA35NSOS
PK3.GPIOParameters=PinAttribute
PK3.Locked=true
PK3.PinAttribute=CortexA35NSOS
PK3.Signal=GPIO_Input
PK4.ContextOwner=CortexA35NSOS
PK4.GPIOParameters=PinAttribute
PK4.Locked=true
PK4.PinAttribute=CortexA35NSOS
PK4.Signal=GPXTI4
PK7.ContextOwner=CortexA35NSOS
PK7.GPIOParameters=PinAttribute
PK7.Locked=true
PK7.PinAttribute=CortexA35NSOS
PK7.Signal=GPIO_Input
PZ0.ContextOwner=CortexA35NSOS
PZ0.GPIOParameters=PinAttribute
PZ0.Locked=true
PZ0.PinAttribute=CortexA35NSOS
PZ0.Signal=GPIO_Input
PZ1.ContextOwner=CortexA35NSOS
PZ1.GPIOParameters=PinAttribute
PZ1.Locked=true
PZ1.PinAttribute=CortexA35NSOS
PZ1.Signal=GPIO_Input
PZ2.ContextOwner=CortexA35NSOS
PZ2.GPIOParameters=PinAttribute
PZ2.Locked=true
PZ2.PinAttribute=CortexA35NSOS
PZ2.Signal=GPIO_Input
PZ5.ContextOwner=CortexA35NSOS
PZ5.GPIOParameters=PinAttribute
PZ5.Locked=true
PZ5.PinAttribute=CortexA35NSOS
PZ5.Signal=GPIO_Input
PZ6.ContextOwner=CortexA35NSOS
PZ6.GPIOParameters=PinAttribute
PZ6.Locked=true
PZ6.PinAttribute=CortexA35NSOS
PZ6.Signal=GPIO_Input
PZ9.ContextOwner=CortexA35NSOS
PZ9.GPIOParameters=PinAttribute
PZ9.Locked=true
PZ9.PinAttribute=CortexA35NSOS
PZ9.Signal=GPIO_Input
PinOutPanel.CurrentBGAView=Top
PinOutPanel.RotationAngle=0
RCC.ADC12Freq_Value=64000000
RCC.ADC3Freq_Value=64000000
RCC.AHB1234Freq_Value=32000000
RCC.APB1Freq_Value=32000000
RCC.APB2Freq_Value=32000000
RCC.APB3Freq_Value=32000000
RCC.APB4Freq_Value=32000000
RCC.APBDBGFreq_Value=32000000
RCC.D3PERCLKSource=MUX_D3PER_LSI
RCC.D3PERFreq_Value=32000
RCC.DSIBLANEFreq_Value=21333333.333333332
RCC.DSIPHYFreq_Value=21333333.333333332
RCC.DTSCLKSource=MUX_DTS_HSE
RCC.DTSFreq_Value=40000000
RCC.FBDIV1=30
RCC.FBDIV2=30
RCC.FBDIV3=20
RCC.FBDIV4=30
RCC.FBDIV5=133
RCC.FBDIV8=297
RCC.FOUTPOSTDIV1Freq_Value=1200000000
RCC.FOUTPOSTDIV2Freq_Value=600000000
RCC.FOUTPOSTDIV3Freq_Value=800000000
RCC.FOUTPOSTDIV4Freq_Value=1200000000
RCC.FOUTPOSTDIV5Freq_Value=532000000
RCC.FOUTPOSTDIV6Freq_Value=500000000
RCC.FOUTPOSTDIV7Freq_Value=1600000000
RCC.FOUTPOSTDIV8Freq_Value=594000000
RCC.FREFDIV5=5
RCC.FREFDIV8=5
RCC.FamilyName=M
RCC.HSE_VALUE=40000000
RCC.HSI_VALUE=64000000
