STMicroelectronics/STM32_open_pin_data/boards/M33_Evaluation_Board_STM32MP257F-EV1_STM32MP257FAI_Board_AllConfig.ioc
RCC.IPParameters=ADC12Freq_Value,ADC3Freq_Value,AHB1234Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,APBDBGFreq_Value,D3PERCLKSource,D3PERFreq_Value,DSIBLANEFreq_Value,DSIPHYFreq_Value,DTSCLKSource,DTSFreq_Value,FBDIV1,FBDIV2,FBDIV3,FBDIV4,FBDIV5,FBDIV8,FOUTPOSTDIV1Freq_Value,FOUTPOSTDIV2Freq_Value,FOUTPOSTDIV3Freq_Value,FOUTPOSTDIV4Freq_Value,FOUTPOSTDIV5Freq_Value,FOUTPOSTDIV6Freq_Value,FOUTPOSTDIV7Freq_Value,FOUTPOSTDIV8Freq_Value,FREFDIV5,FREFDIV8,FamilyName,HSE_VALUE,HSI_VALUE,LSE_VALUE,LSI_VALUE,LVDSFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,MCUCLKFreq_VALUE,MCUClockFreq_Value,MCUDIVCLKFreq_Value,MCU_Div,MSI_VALUE,Obs0Freq_Value,Obs1Freq_Value,PLL1Source,PLL2FRACV,PLL2Source,PLL3FRACV,PLL3Source,PLL4Source,PLL5Source,PLL6Source,PLL8Source,POSTDIV2_2,POSTDIV2_5,POSTDIV2_6,POSTDIV2_8,ROOT0Freq_VALUE,ROOT10Freq_VALUE,ROOT11Freq_VALUE,ROOT12Freq_VALUE,ROOT13Freq_VALUE,ROOT14Freq_VALUE,ROOT15Freq_VALUE,ROOT16Freq_VALUE,ROOT17Freq_VALUE,ROOT18Freq_VALUE,ROOT19Freq_VALUE,ROOT1Freq_VALUE,ROOT20Freq_VALUE,ROOT21Freq_VALUE,ROOT22Freq_VALUE,ROOT23Freq_VALUE,ROOT24Freq_VALUE,ROOT25Freq_VALUE,ROOT26Freq_VALUE,ROOT27Freq_VALUE,ROOT28Freq_VALUE,ROOT29Freq_VALUE,ROOT2Freq_VALUE,ROOT30Freq_VALUE,ROOT31Freq_VALUE,ROOT32Freq_VALUE,ROOT33Freq_VALUE,ROOT34Freq_VALUE,ROOT36Freq_VALUE,ROOT37Freq_VALUE,ROOT38Freq_VALUE,ROOT39Freq_VALUE,ROOT3Freq_VALUE,ROOT40Freq_VALUE,ROOT41Freq_VALUE,ROOT42Freq_VALUE,ROOT43Freq_VALUE,ROOT44Freq_VALUE,ROOT45Freq_VALUE,ROOT46Freq_VALUE,ROOT47Freq_VALUE,ROOT48Freq_VALUE,ROOT49Freq_VALUE,ROOT4Freq_VALUE,ROOT50Freq_VALUE,ROOT51Freq_VALUE,ROOT52Freq_VALUE,ROOT53Freq_VALUE,ROOT54Freq_VALUE,ROOT55Freq_VALUE,ROOT56Freq_VALUE,ROOT57Freq_VALUE,ROOT58Freq_VALUE,ROOT59Freq_VALUE,ROOT5Freq_VALUE,ROOT60Freq_VALUE,ROOT61Freq_VALUE,ROOT62Freq_VALUE,ROOT63Freq_VALUE,ROOT6Freq_VALUE,ROOT7Freq_VALUE,ROOT8Freq_VALUE,ROOT9Freq_VALUE,RTCCLockSelection,RTCCLockSelectionVirtual,RTCFreq_Value,Tim1OutputFreq_Value,Tim2OutputFreq_Value,USB2PHY1Freq_Value,USB2PHY2Freq_Value,USB3PCIPHYFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCO4OutputFreq_Value,VCO5OutputFreq_Value,VCO6OutputFreq_Value,VCO7OutputFreq_Value,VCO8OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value,VCOInput4Freq_Value,VCOInput5Freq_Value,VCOInput6Freq_Value,VCOInput7Freq_Value,VCOInput8Freq_Value,XBAR0CLKSource,XBAR0Findiv,XBAR12CLKSource,XBAR12Findiv,XBAR15CLKSource,XBAR15Findiv,XBAR1CLKSource,XBAR1Findiv,XBAR26CLKSource,XBAR26Findiv,XBAR27CLKSource,XBAR27Findiv,XBAR28Findiv,XBAR29CLKSource,XBAR29Findiv,XBAR2CLKSource,XBAR2Findiv,XBAR30CLKSource,XBAR30Findiv,XBAR31CLKSource,XBAR31Findiv,XBAR32CLKSource,XBAR32Findiv,XBAR33CLKSource,XBAR33Findiv,XBAR34CLKSource,XBAR34Findiv,XBAR3CLKSource,XBAR3Findiv,XBAR43CLKSource,XBAR43Findiv,XBAR44CLKSource,XBAR44Findiv,XBAR45CLKSource,XBAR45Findiv,XBAR49CLKSource,XBAR49Findiv,XBAR4CLKSource,XBAR4Findiv,XBAR51CLKSource,XBAR51Findiv,XBAR52CLKSource,XBAR52Findiv,XBAR54CLKSource,XBAR54Findiv,XBAR55CLKSource,XBAR55Findiv,XBAR56CLKSource,XBAR56Findiv,XBAR57CLKSource,XBAR57Findiv,XBAR58CLKSource,XBAR58Findiv,XBAR59CLKSource,XBAR59Findiv,XBAR5CLKSource,XBAR5Findiv,XBAR60CLKSource,XBAR60Findiv,XBAR63CLKSource,XBAR63Findiv,XBAR6CLKSource,XBAR6Findiv,XBAR7CLKSource,XBAR7Findiv,XBAR8Findiv
RCC.LSE_VALUE=32768
RCC.LSI_VALUE=32000
RCC.LVDSFreq_Value=26600000
RCC.MCO1PinFreq_Value=64000000
RCC.MCO2PinFreq_Value=64000000
RCC.MCUCLKFreq_VALUE=64000000
RCC.MCUClockFreq_Value=64000000
RCC.MCUDIVCLKFreq_Value=32000000
RCC.MCU_Div=RCC_MCU_DIV2
RCC.MSI_VALUE=16000000
RCC.Obs0Freq_Value=16000000
RCC.Obs1Freq_Value=16000000
RCC.PLL1Source=RCC_PLL1SOURCE_HSE
RCC.PLL2FRACV=0
RCC.PLL2Source=RCC_PLL2SOURCE_HSE
RCC.PLL3FRACV=0
RCC.PLL3Source=RCC_PLL3SOURCE_HSE
RCC.PLL4Source=RCC_PLL4SOURCE_HSE
RCC.PLL5Source=RCC_PLL5SOURCE_HSE
RCC.PLL6Source=RCC_PLL6SOURCE_HSE
RCC.PLL8Source=RCC_PLL8SOURCE_HSE
RCC.POSTDIV2_2=2
RCC.POSTDIV2_5=2
RCC.POSTDIV2_6=2
RCC.POSTDIV2_8=4
RCC.ROOT0Freq_VALUE=400000000
RCC.ROOT10Freq_VALUE=64000000
RCC.ROOT11Freq_VALUE=64000000
RCC.ROOT12Freq_VALUE=100000000
RCC.ROOT13Freq_VALUE=64000000
RCC.ROOT14Freq_VALUE=64000000
RCC.ROOT15Freq_VALUE=120000000
RCC.ROOT16Freq_VALUE=64000000
RCC.ROOT17Freq_VALUE=64000000
RCC.ROOT18Freq_VALUE=64000000
RCC.ROOT19Freq_VALUE=64000000
RCC.ROOT1Freq_VALUE=200000000
RCC.ROOT20Freq_VALUE=64000000
RCC.ROOT21Freq_VALUE=64000000
RCC.ROOT22Freq_VALUE=64000000
RCC.ROOT23Freq_VALUE=64000000
RCC.ROOT24Freq_VALUE=64000000
RCC.ROOT25Freq_VALUE=64000000
RCC.ROOT26Freq_VALUE=120000000
RCC.ROOT27Freq_VALUE=297000000
RCC.ROOT28Freq_VALUE=21333333.333333332
RCC.ROOT29Freq_VALUE=266000000
RCC.ROOT2Freq_VALUE=600000000
RCC.ROOT30Freq_VALUE=20000000
RCC.ROOT31Freq_VALUE=26600000
RCC.ROOT32Freq_VALUE=26600000
RCC.ROOT33Freq_VALUE=50000000
RCC.ROOT34Freq_VALUE=25000000
RCC.ROOT36Freq_VALUE=16000000
RCC.ROOT37Freq_VALUE=64000000
RCC.ROOT38Freq_VALUE=64000000
RCC.ROOT39Freq_VALUE=64000000
RCC.ROOT3Freq_VALUE=400000000
RCC.ROOT40Freq_VALUE=64000000
RCC.ROOT41Freq_VALUE=64000000
RCC.ROOT42Freq_VALUE=64000000
RCC.ROOT43Freq_VALUE=50000000
RCC.ROOT44Freq_VALUE=200000000
RCC.ROOT45Freq_VALUE=400000000
RCC.ROOT46Freq_VALUE=64000000
RCC.ROOT47Freq_VALUE=64000000
RCC.ROOT48Freq_VALUE=64000000
RCC.ROOT49Freq_VALUE=133000000
RCC.ROOT4Freq_VALUE=300000000
RCC.ROOT50Freq_VALUE=64000000
RCC.ROOT51Freq_VALUE=200000000
RCC.ROOT52Freq_VALUE=200000000
RCC.ROOT53Freq_VALUE=64000000
RCC.ROOT54Freq_VALUE=125000000
RCC.ROOT55Freq_VALUE=125000000
RCC.ROOT56Freq_VALUE=200000000
RCC.ROOT57Freq_VALUE=20000000
RCC.ROOT58Freq_VALUE=20000000
RCC.ROOT59Freq_VALUE=600000000
RCC.ROOT5Freq_VALUE=400000000
RCC.ROOT60Freq_VALUE=50000000
RCC.ROOT61Freq_VALUE=64000000
RCC.ROOT62Freq_VALUE=64000000
RCC.ROOT63Freq_VALUE=400000000
RCC.ROOT6Freq_VALUE=600000000
RCC.ROOT7Freq_VALUE=100000000
RCC.ROOT8Freq_VALUE=5333333.333333333
RCC.ROOT9Freq_VALUE=64000000
RCC.RTCCLockSelection=RCC_RTCCLKSOURCE_LSE
RCC.RTCCLockSelectionVirtual=RCC_RTCCLKSOURCE_LSE
RCC.RTCFreq_Value=32768
RCC.Tim1OutputFreq_Value=32000000
RCC.Tim2OutputFreq_Value=32000000
RCC.USB2PHY1Freq_Value=20000000
RCC.USB2PHY2Freq_Value=20000000
RCC.USB3PCIPHYFreq_Value=25000000
RCC.VCO1OutputFreq_Value=1200000000
RCC.VCO2OutputFreq_Value=1200000000
RCC.VCO3OutputFreq_Value=800000000
RCC.VCO4OutputFreq_Value=1200000000
RCC.VCO5OutputFreq_Value=1064000000
RCC.VCO6OutputFreq_Value=1000000000
RCC.VCO7OutputFreq_Value=1600000000
RCC.VCO8OutputFreq_Value=2376000000
RCC.VCOInput1Freq_Value=40000000
RCC.VCOInput2Freq_Value=40000000
RCC.VCOInput3Freq_Value=40000000
RCC.VCOInput4Freq_Value=40000000
RCC.VCOInput5Freq_Value=8000000
RCC.VCOInput6Freq_Value=40000000
RCC.VCOInput7Freq_Value=64000000
RCC.VCOInput8Freq_Value=8000000
RCC.XBAR0CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR0Findiv=3
RCC.XBAR12CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR12Findiv=12
RCC.XBAR15CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR15Findiv=10
RCC.XBAR1CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR1Findiv=6
RCC.XBAR26CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR26Findiv=10
RCC.XBAR27CLKSource=RCC_XBAR_CLKSRC_PLL8
RCC.XBAR27Findiv=2
RCC.XBAR28Findiv=3
RCC.XBAR29CLKSource=RCC_XBAR_CLKSRC_PLL5
RCC.XBAR29Findiv=2
RCC.XBAR2CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR2Findiv=2
RCC.XBAR30CLKSource=RCC_XBAR_CLKSRC_HSE
RCC.XBAR30Findiv=2
RCC.XBAR31CLKSource=RCC_XBAR_CLKSRC_PLL5
RCC.XBAR31Findiv=20
RCC.XBAR32CLKSource=RCC_XBAR_CLKSRC_PLL5
RCC.XBAR32Findiv=20
RCC.XBAR33CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR33Findiv=24
RCC.XBAR34CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR34Findiv=48
RCC.XBAR3CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR3Findiv=3
RCC.XBAR43CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR43Findiv=24
RCC.XBAR44CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR44Findiv=6
RCC.XBAR45CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR45Findiv=3
RCC.XBAR49CLKSource=RCC_XBAR_CLKSRC_PLL5
RCC.XBAR49Findiv=4
RCC.XBAR4CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR4Findiv=4
RCC.XBAR51CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR51Findiv=6
RCC.XBAR52CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR52Findiv=6
RCC.XBAR54CLKSource=RCC_XBAR_CLKSRC_PLL6
RCC.XBAR54Findiv=4
RCC.XBAR55CLKSource=RCC_XBAR_CLKSRC_PLL6
RCC.XBAR55Findiv=4
RCC.XBAR56CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR56Findiv=6
RCC.XBAR57CLKSource=RCC_XBAR_CLKSRC_HSE
RCC.XBAR57Findiv=2
RCC.XBAR58CLKSource=RCC_XBAR_CLKSRC_HSE
RCC.XBAR58Findiv=2
RCC.XBAR59CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR59Findiv=2
RCC.XBAR5CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR5Findiv=3
RCC.XBAR60CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR60Findiv=24
RCC.XBAR63CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR63Findiv=3
RCC.XBAR6CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR6Findiv=2
RCC.XBAR7CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR7Findiv=12
RCC.XBAR8Findiv=12
RIF.DCMIPP_CID_RIMU=1
RIF.DCMIPP_CID_RIMU-10=-
RIF.DCMIPP_Privilege_RIMU=true
RIF.DCMIPP_Privilege_RIMU-10=true
RIF.ETH1_CID_RIMU=1
RIF.ETH1_CID_RIMU-6=-
RIF.ETH1_Privilege_RIMU=true
RIF.ETH1_Privilege_RIMU-6=true
RIF.ETH2_CID_RIMU=1
RIF.ETH2_CID_RIMU-7=-
RIF.ETH2_Privilege_RIMU=true
RIF.ETH2_Privilege_RIMU-7=true
RIF.GPU_CID_RIMU=1
RIF.GPU_CID_RIMU-9=-
RIF.GPU_Privilege_RIMU=true
RIF.GPU_Privilege_RIMU-9=true
RIF.IPParameters=VENC_CID_RIMU-15,OCTOSPI1_Secured,RISAF_DDR_End_Address,SYSRAM1_region1_Region_Name,SRAM1_region2_Region_Name,SRAM2_region1_Region_Name,RETRAM_region1_Region_Name,RISAF_OCTOSPI_region1_Region_Size,RISAF_DDR6_Region_Size_4GO,RISAF_DDR9_Region_Size_4GO,RISAF_DDR11_Region_Size_4GO,RISAF_DDR12_Region_Size_4GO,RISAF_DDR14_Region_Size_4GO,RETRAM_region1_Region_Size,RETRAM_region3_Region_Size,RETRAM_region4_Region_Size,RETRAM_region5_Region_Size,RETRAM_region6_Region_Size,VDERAM_region2_Region_Name,RISAF_BKPSRAM_Region1_Name,VDERAM_region1_Region_Size,VDERAM_region2_Region_Size,VDERAM_region3_Region_Size,VDERAM_region4_Region_Size,VDERAM_region5_Region_Size,VDERAM_region6_Region_Size,RISAF_DDR_Region_ID_7_Master_CID0_Read,RISAF_DDR_Region_ID_7_Master_CID0_Write,RISAF_DDR_Region7_Encrypted,RISAF_DDR_Region8_Encrypted,RISAF_DDR_Region_ID_8_Master_CID0_Read,RISAF_DDR_Region_ID_8_Master_CID0_Write,RISAF_DDR_Region_ID_7_Master_CID1_Read,RISAF_DDR_Region_ID_7_Master_CID0_Privilege,RISAF_DDR_Region_ID_8_Master_CID0_Privilege,RISAF_DDR_Region_ID_8_Master_CID1_Read,RISAF_DDR_Region_ID_8_Master_CID1_Write,RISAF_DDR_Region8_Secured,RISAF_DDR_Region7_Secured,RISAF_DDR_Region_ID_7_Master_CID1_Privilege,RISAF_DDR_Region_ID_7_Master_CID1_Write,RISAF_BKPSRAM_Region_ID_1_Master_CID1_Read,RISAF_BKPSRAM_Region_ID_1_Master_CID1_Write,RISAF_BKPSRAM_Region_ID_1_Master_CID1_Privilege,SRAM1_region1_secured,SRAM1_region1_priv,SRAM1_region1_CID_Filtering,SRAM1_region1_Master_CID1_Read,SRAM1_region1_Master_CID2_Read,SRAM1_region1_Master_CID1_Write,SRAM1_region1_Master_CID1_Privilege,SRAM1_region1_Master_CID2_Privilege,RISAF_DDR_Region_ID_4_Master_CID2_Read,RISAF_DDR_Region_ID_4_Master_CID2_Write,RISAF_DDR_Region_ID_2_Master_CID2_Read,RISAF_DDR_Region_ID_2_Master_CID2_Write,RETRAM_region1_secured,RETRAM_region1_priv,RETRAM_region1_CID_Filtering,RETRAM_region1_Master_CID2_Read,RETRAM_region1_Master_CID2_Write,SRAM2_region1_priv,SRAM2_region1_CID_Filtering,SRAM2_region1_Master_CID2_Read,SRAM2_region1_Master_CID2_Write,RETRAM_region2_secured,RETRAM_region2_CID_Filtering,RETRAM_region2_Master_CID1_Read,RETRAM_region2_Master_CID1_Write,RETRAM_region2_Master_CID1_Privilege,RISAF_BKPSRAM_Region1_Secured,SRAM1_region2_priv,VDERAM_region2_secured,VDERAM_region2_priv,VDERAM_region2_CID_Filtering,VDERAM_region2_Master_CID1_Read,VDERAM_region2_Master_CID1_Write,VDERAM_region2_Master_CID1_Privilege,SRAM1_region2_CID_Filtering,SRAM1_region2_Master_CID2_Read,SRAM1_region2_Master_CID2_Write,SDMMC1_CID_RIMU-1,SDMMC2_CID_RIMU-2,SDMMC3_CID_RIMU-3,USB3DR_CID_RIMU-4,USBH_CID_RIMU-5,ETH1_CID_RIMU-6,ETH2_CID_RIMU-7,PCIE_CID_RIMU-8,GPU_CID_RIMU-9,DCMIPP_CID_RIMU-10,LTDC_ROT_CID_Selection_RIMU,VDEC_CID_RIMU-14,SDMMC1_Privilege_RIMU-1,SDMMC1_Privilege_RIMU,SDMMC2_Privilege_RIMU-2,SDMMC2_Privilege_RIMU,SDMMC3_Privilege_RIMU-3,SDMMC3_Privilege_RIMU,USBH_Privilege_RIMU-5,USBH_Privilege_RIMU,ETH1_Privilege_RIMU-6,ETH1_Privilege_RIMU,ETH2_Privilege_RIMU-7,ETH2_Privilege_RIMU,PCIE_Privilege_RIMU-8,PCIE_Privilege_RIMU,GPU_Privilege_RIMU-9,GPU_Privilege_RIMU,DCMIPP_Privilege_RIMU-10,DCMIPP_Privilege_RIMU,LTDC_L3_Privilege_RIMU-12,LTDC_L3_Privilege_RIMU,VDEC_Privilege_RIMU-14,VDEC_Privilege_RIMU,VENC_Privilege_RIMU-15,VENC_Privilege_RIMU,RISAF_PCIE_Region_ID_1_Master_CID1_Read,RISAF_PCIE_Region_ID_1_Master_CID1_Write,LTDC_L3_Secure_RIMU-12,LTDC_L3_CID_Selection_RIMU,LTDC_ROT_Privilege_RIMU-13,LTDC_ROT_Privilege_RIMU,LTDC_L1L2_Privilege_RIMU-11,LTDC_L1L2_Privilege_RIMU,USB3DR_Privilege_RIMU-4,USB3DR_Privilege_RIMU,RISAF_DDR_Region_ID_9_Master_CID1_Read,RISAF_DDR_Region_ID_9_Master_CID1_Write,RISAF_DDR_Region_ID_9_Master_CID4_Read,RISAF_DDR_Region_ID_9_Master_CID4_Write,RISAF_DDR_Region_ID_15_Master_CID1_Read,RISAF_DDR_Region_ID_15_Master_CID1_Write,RISAF_DDR_Region_ID_13_Master_CID1_Read,RISAF_DDR_Region_ID_13_Master_CID1_Write,RISAF_DDR_Region_ID_13_Master_CID4_Read,RISAF_DDR_Region_ID_13_Master_CID4_Write,RISAF_DDR_Region_ID_14_Master_CID1_Read,RISAF_DDR_Region_ID_14_Master_CID1_Write,RISAF_DDR_Region_ID_14_Master_CID4_Read,RISAF_DDR_Region_ID_14_Master_CID4_Write,RISAF_OCTOSPI_Region_ID_2_Master_CID2_Read,RISAF_OCTOSPI_Region_ID_2_Master_CID2_Write,SYSRAM1_region1_CID_Filtering,SYSRAM1_region1_priv,SYSRAM1_region1_Master_CID1_Read,SYSRAM1_region1_Master_CID1_Write,SYSRAM1_region1_Master_CID1_Privilege,RISAF_DDR_Region_ID_1_Master_CID2_Read,RISAF_DDR_Region_ID_1_Master_CID2_Write,RISAF_DDR_Region1_Secured,RISAF_DDR_Region1_Encrypted,RISAF_DDR_Region_ID_3_Master_CID2_Read,RISAF_DDR_Region_ID_3_Master_CID2_Write,RISAF_DDR_Region3_Secured,RISAF_DDR_Region3_Encrypted,RISAF_BKPSRAM_Region_ID_2_Master_CID2_Read,RISAF_BKPSRAM_Region_ID_2_Master_CID2_Write,RISAF_BKPSRAM_Region_ID_2_Master_CID2_Privilege,RISAF_BKPSRAM_Region2_Secured,RISAF_DDR_Region_ID_10_Master_CID1_Read,RISAF_DDR_Region_ID_10_Master_CID1_Write,RISAF_DDR_Region_ID_10_Master_CID4_Read,RISAF_DDR_Region_ID_10_Master_CID4_Write,RISAF_DDR_Region_ID_5_Master_CID2_Read,RISAF_DDR_Region_ID_5_Master_CID2_Write,RISAF_DDR_Region_ID_5_Master_CID1_Read,RISAF_DDR_Region_ID_5_Master_CID1_Write,SYSRAM2_region1_CID_Filtering,SYSRAM2_region1_Master_CID1_Read,SYSRAM2_region1_Master_CID1_Write,SYSRAM2_region1_Master_CID1_Privilege,SYSRAM1_region1_secured,SDMMC1_CID_RIMU,SDMMC2_CID_RIMU,SDMMC3_CID_RIMU,USB3DR_CID_RIMU,USBH_CID_RIMU,ETH1_CID_RIMU,ETH2_CID_RIMU,PCIE_CID_RIMU,GPU_CID_RIMU,DCMIPP_CID_RIMU,VDEC_CID_RIMU,VENC_CID_RIMU,RISAF_OCTOSPI_Region_ID_2_Master_CID1_Privilege,OCTOSPI2_Secured,RISAF_OCTOSPI_Region_ID_1_Master_CID0_Privilege,RISAF_OCTOSPI_Region_ID_1_Master_CID1_Privilege,RISAF_OCTOSPI_Region_ID_1_Master_CID2_Privilege,RISAF_OCTOSPI_Region_ID_2_Master_CID0_Privilege,RISAF_OCTOSPI_Region_ID_2_Master_CID2_Privilege,RISAF_OCTOSPI_Region1_Encrypted,RISAF_DDR6_Region_Size,RISAF_DDR7_Region_Size,RISAF_DDR11_Region_Size,RISAF_DDR12_Region_Size,RISAF_DDR9_Region_Size,RISAF_DDR14_Region_Size,RISAF_DDR_Region9_Name,RISAF_DDR_Region15_Name
RIF.LTDC_L1L2_Privilege_RIMU=true
RIF.LTDC_L1L2_Privilege_RIMU-11=true
RIF.LTDC_L3_CID_Selection_RIMU=false
RIF.LTDC_L3_Privilege_RIMU=true
RIF.LTDC_L3_Privilege_RIMU-12=true
RIF.LTDC_L3_Secure_RIMU-12=false
RIF.LTDC_ROT_CID_Selection_RIMU=false
RIF.LTDC_ROT_Privilege_RIMU=true
RIF.LTDC_ROT_Privilege_RIMU-13=true
RIF.OCTOSPI1_Secured=true
RIF.OCTOSPI2_Secured=true
RIF.PCIE_CID_RIMU=1
RIF.PCIE_CID_RIMU-8=-
RIF.PCIE_Privilege_RIMU=true
RIF.PCIE_Privilege_RIMU-8=true
RIF.RETRAM_region1_CID_Filtering=true
RIF.RETRAM_region1_Master_CID2_Read=true
RIF.RETRAM_region1_Master_CID2_Write=true
RIF.RETRAM_region1_Region_Name=cm33_retram
RIF.RETRAM_region1_Region_Size=0x1f000
RIF.RETRAM_region1_priv=false
RIF.RETRAM_region1_secured=true
RIF.RETRAM_region2_CID_Filtering=true
RIF.RETRAM_region2_Master_CID1_Privilege=true
RIF.RETRAM_region2_Master_CID1_Read=true
RIF.RETRAM_region2_Master_CID1_Write=true
RIF.RETRAM_region2_secured=true
RIF.RETRAM_region3_Region_Size=0x0
RIF.RETRAM_region4_Region_Size=0x0
RIF.RETRAM_region5_Region_Size=0x0
RIF.RETRAM_region6_Region_Size=0x0
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_CMN\ Cid=1
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_CMN\ CortexA35NSOS=true
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_CMN\ CortexA35NSSSBL=true
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_CMN\ Secure=false
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_RDFIFO\ Cid=1
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_RDFIFO\ CortexA35NSOS=true
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_RDFIFO\ CortexA35NSSSBL=true
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_RDFIFO\ Secure=false
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_TRIG\ Cid=1
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_TRIG\ CortexA35NSOS=true
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_TRIG\ CortexA35NSSSBL=true
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_TRIG\ Secure=false
RIF.RIFAWARE.ETHSW\ Feature\ ETHSW_ACM_CFG\ Cid=1
RIF.RIFAWARE.ETHSW\ Feature\ ETHSW_ACM_CFG\ CortexA35NSOS=true
RIF.RIFAWARE.ETHSW\ Feature\ ETHSW_ACM_CFG\ Secure=false
RIF.RIFAWARE.ETHSW\ Feature\ ETHSW_ACM_MSGBUF\ Cid=1
RIF.RIFAWARE.ETHSW\ Feature\ ETHSW_ACM_MSGBUF\ CortexA35NSOS=true
RIF.RIFAWARE.ETHSW\ Feature\ ETHSW_ACM_MSGBUF\ Secure=false
RIF.RIFAWARE.ETHSW\ Feature\ ETHSW_DEIP\ Cid=1
RIF.RIFAWARE.ETHSW\ Feature\ ETHSW_DEIP\ CortexA35NSOS=true
RIF.RIFAWARE.ETHSW\ Feature\ ETHSW_DEIP\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ COMBOPHY\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ COMBOPHY\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ COMBOPHY\ CortexA35NSSSBL=true
RIF.RIFAWARE.EXTI1\ Feature\ COMBOPHY\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ COMBOPHY\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ CPU2\ SYSRESETREQ\ local\ CPU2\ reset\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ CPU2\ SYSRESETREQ\ local\ CPU2\ reset\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ CPU2\ SYSRESETREQ\ local\ CPU2\ reset\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ DTS\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ DTS\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ DTS\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ ETH1_PMT\ wakeup\ Cid=1
