STMicroelectronics/STM32_open_pin_data/boards/M33_Evaluation_Board_STM32MP257F-EV1_STM32MP257FAI_Board_AllConfig.ioc
RIF.RIFAWARE.EXTI1\ Feature\ ETH1_PMT\ wakeup\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ ETH1_PMT\ wakeup\ CortexA35NSSSBL=true
RIF.RIFAWARE.EXTI1\ Feature\ ETH1_PMT\ wakeup\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ ETH1_PMT\ wakeup\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ ETH1_SBD\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ ETH1_SBD\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ ETH1_SBD\ CortexA35NSSSBL=true
RIF.RIFAWARE.EXTI1\ Feature\ ETH1_SBD\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ ETH1_SBD\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ ETH2_PMT\ wakeup\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ ETH2_PMT\ wakeup\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ ETH2_PMT\ wakeup\ CortexA35NSSSBL=true
RIF.RIFAWARE.EXTI1\ Feature\ ETH2_PMT\ wakeup\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ ETH2_PMT\ wakeup\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ ETH2_SBD\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ ETH2_SBD\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ ETH2_SBD\ CortexA35NSSSBL=true
RIF.RIFAWARE.EXTI1\ Feature\ ETH2_SBD\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ ETH2_SBD\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[0]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[0]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[10]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[10]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[11]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[11]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[12]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[12]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[13]\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[13]\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[13]\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[13]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[14]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[14]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[15]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[15]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[1]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[1]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[2]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[2]\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[2]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[3]\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[3]\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[3]\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[3]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[4]\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[4]\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[4]\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[4]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[5]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[5]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[6]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[6]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[7]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[7]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[8]\ Cid=2
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[8]\ CortexM33NS=true
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[8]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[9]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[9]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ HPDMA1\ Channel\ 0\ to\ 15\ CPU1\ irq\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ HPDMA1\ Channel\ 0\ to\ 15\ CPU1\ irq\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ HPDMA1\ Channel\ 0\ to\ 15\ CPU2\ irq\ Cid=2
RIF.RIFAWARE.EXTI1\ Feature\ HPDMA2\ Channel\ 0\ to\ 15\ CPU1\ irq\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ HPDMA2\ Channel\ 0\ to\ 15\ CPU1\ irq\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ HPDMA2\ Channel\ 0\ to\ 15\ CPU2\ irq\ Cid=2
RIF.RIFAWARE.EXTI1\ Feature\ HPDMA3\ Channel\ 0\ to\ 15\ CPU1\ irq\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ HPDMA3\ Channel\ 0\ to\ 15\ CPU1\ irq\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ HPDMA3\ Channel\ 0\ to\ 15\ CPU2\ irq\ Cid=2
RIF.RIFAWARE.EXTI1\ Feature\ I2C1\ Cid=2
RIF.RIFAWARE.EXTI1\ Feature\ I2C1\ CortexM33NS=true
RIF.RIFAWARE.EXTI1\ Feature\ I2C1\ Privilege=false
RIF.RIFAWARE.EXTI1\ Feature\ I2C1\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I2C2\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ I2C2\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ I2C2\ CortexA35NSSSBL=true
RIF.RIFAWARE.EXTI1\ Feature\ I2C2\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I2C3\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ I2C3\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I2C4\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ I2C4\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I2C5\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ I2C5\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I2C6\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ I2C6\ Privilege=false
RIF.RIFAWARE.EXTI1\ Feature\ I2C6\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I2C7\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ I2C7\ CortexA35SFSBLA=true
RIF.RIFAWARE.EXTI1\ Feature\ I2C7\ CortexA35SSecureOS=true
RIF.RIFAWARE.EXTI1\ Feature\ I2C7\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ I2C7\ Secure=true
RIF.RIFAWARE.EXTI1\ Feature\ I3C1\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ I3C1\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I3C2\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ I3C2\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I3C3\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ I3C3\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ non\ secure\ interrupt\ CPU1\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ non\ secure\ interrupt\ CPU1\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ non\ secure\ interrupt\ CPU1\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ non\ secure\ interrupt\ CPU2\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ non\ secure\ interrupt\ CPU2\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ secure\ interrupt\ CPU1\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ secure\ interrupt\ CPU1\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ secure\ interrupt\ CPU1\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ secure\ interrupt\ CPU2\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ secure\ interrupt\ CPU2\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ secure\ interrupt\ CPU2\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ LPTIM1\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ LPTIM1\ CortexA35SSecureOS=true
RIF.RIFAWARE.EXTI1\ Feature\ LPTIM1\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ LPTIM1\ Secure=true
RIF.RIFAWARE.EXTI1\ Feature\ LPTIM2\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ LPTIM2\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ LPTIM2\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ PVD\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ PVD\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ PVD\ Secure=true
RIF.RIFAWARE.EXTI1\ Feature\ PVM\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ PVM\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ PVM\ Secure=true
RIF.RIFAWARE.EXTI1\ Feature\ RCC_HSI_FMON\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ RCC_HSI_FMON\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ RCC_HSI_FMON\ Secure=true
RIF.RIFAWARE.EXTI1\ Feature\ SPI1\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ SPI1\ Privilege=false
RIF.RIFAWARE.EXTI1\ Feature\ SPI1\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ SPI2\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ SPI2\ Privilege=false
RIF.RIFAWARE.EXTI1\ Feature\ SPI2\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ SPI3\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ SPI3\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ SPI4\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ SPI4\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ SPI5\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ SPI5\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ SPI6\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ SPI6\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ SPI7\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ SPI7\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ UART4\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ UART4\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ UART5\ Cid=2
RIF.RIFAWARE.EXTI1\ Feature\ UART5\ CortexM33SSecureOS=true
RIF.RIFAWARE.EXTI1\ Feature\ UART5\ Secure=true
RIF.RIFAWARE.EXTI1\ Feature\ UART7\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ UART7\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ UART8\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ UART8\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ UART9\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ UART9\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ UCPD\ Cid=2
RIF.RIFAWARE.EXTI1\ Feature\ UCPD\ CortexM33NS=true
RIF.RIFAWARE.EXTI1\ Feature\ UCPD\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ UCPD\ VBUS\ DETECT\ Cid=2
RIF.RIFAWARE.EXTI1\ Feature\ UCPD\ VBUS\ DETECT\ CortexM33NS=true
RIF.RIFAWARE.EXTI1\ Feature\ UCPD\ VBUS\ DETECT\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ UCPD\ VBUS\ VSAFE5V\ Cid=2
RIF.RIFAWARE.EXTI1\ Feature\ UCPD\ VBUS\ VSAFE5V\ CortexM33NS=true
RIF.RIFAWARE.EXTI1\ Feature\ UCPD\ VBUS\ VSAFE5V\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ USART1\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ USART1\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ USART2\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ USART2\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ USART2\ CortexA35NSSSBL=true
RIF.RIFAWARE.EXTI1\ Feature\ USART2\ CortexA35SFSBLA=true
RIF.RIFAWARE.EXTI1\ Feature\ USART2\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ USART2\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ USART3\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ USART3\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ USART6\ Cid=2
RIF.RIFAWARE.EXTI1\ Feature\ USART6\ CortexM33SSecureOS=true
RIF.RIFAWARE.EXTI1\ Feature\ USART6\ Secure=true
RIF.RIFAWARE.EXTI1\ Feature\ USB3DR\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ USB3DR\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ USB3DR\ CortexA35NSSSBL=true
RIF.RIFAWARE.EXTI1\ Feature\ USB3DR\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ USB3DR\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ USBH\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ USBH\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ USBH\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ USBH\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ VDDGPU_VD\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ WKUP1\ wakeup\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ WKUP1\ wakeup\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ WKUP1\ wakeup\ CortexA35SSecureOS=false
RIF.RIFAWARE.EXTI1\ Feature\ WKUP1\ wakeup\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ WKUP1\ wakeup\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ WKUP2\ wakeup\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ WKUP2\ wakeup\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ WKUP2\ wakeup\ CortexA35SSecureOS=false
RIF.RIFAWARE.EXTI1\ Feature\ WKUP2\ wakeup\ Privilege=true
RIF.RIFAWARE.EXTI1\ Feature\ WKUP2\ wakeup\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ WKUP3\ wakeup\ Cid=2
RIF.RIFAWARE.EXTI1\ Feature\ WKUP3\ wakeup\ CortexA35SSecureOS=false
RIF.RIFAWARE.EXTI1\ Feature\ WKUP3\ wakeup\ CortexM33NS=true
RIF.RIFAWARE.EXTI1\ Feature\ WKUP3\ wakeup\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ WKUP4\ wakeup\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ WKUP4\ wakeup\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ WKUP5\ wakeup\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ WKUP5\ wakeup\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ WKUP6\ wakeup\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ WKUP6\ wakeup\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ WWDG1\ Reset\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ WWDG1\ Reset\ Privilege=false
RIF.RIFAWARE.EXTI2\ Feature\ ADF1\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ ADF1\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ CA35\ SEV\ interrupt\ to\ CPU3\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ CA35\ SEV\ interrupt\ to\ CPU3\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ CM0\ SEV\ interrupt\ Cid=1
RIF.RIFAWARE.EXTI2\ Feature\ CM0\ SEV\ interrupt\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ CM33\ SEV\ interrupt\ to\ CPU3\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ CM33\ SEV\ interrupt\ to\ CPU3\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[0]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[0]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[10]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[10]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[11]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[11]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[12]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[12]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[13]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[13]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[14]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[14]\ Privilege=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[14]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[15]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[15]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[1]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[1]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[2]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[2]\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[2]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[3]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[3]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[4]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[4]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[5]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[5]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[6]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[6]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[7]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[7]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[8]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[8]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[9]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[9]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ HSEM1\ non\ secure\ interrupt\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ HSEM1\ non\ secure\ interrupt\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ HSEM1\ secure\ interrupt\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ HSEM1\ secure\ interrupt\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ HSEM2\ non\ secure\ interrupt\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ HSEM2\ non\ secure\ interrupt\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ HSEM2\ secure\ interrupt\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ HSEM2\ secure\ interrupt\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ HSEM3\ non\ secure\ interrupt\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ HSEM3\ non\ secure\ interrupt\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ I2C8\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ I2C8\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ I2C8\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ I3C4\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ I3C4\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IAC\ interrupt\ CPU1\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ IAC\ interrupt\ CPU1\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ IAC\ interrupt\ CPU1\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IAC\ interrupt\ CPU2\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ IAC\ interrupt\ CPU2\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ IAC\ interrupt\ CPU2\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IPCC2\ non\ secure\ interrupt\ CPU1\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ IPCC2\ non\ secure\ interrupt\ CPU1\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ IPCC2\ non\ secure\ interrupt\ CPU1\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IPCC2\ non\ secure\ interrupt\ CPU2\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ IPCC2\ non\ secure\ interrupt\ CPU2\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IPCC2\ non\ secure\ interrupt\ CPU3\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ IPCC2\ non\ secure\ interrupt\ CPU3\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IPCC2\ secure\ interrupt\ CPU1\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ IPCC2\ secure\ interrupt\ CPU1\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ IPCC2\ secure\ interrupt\ CPU1\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IPCC2\ secure\ interrupt\ CPU2\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ IPCC2\ secure\ interrupt\ CPU2\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ IPCC2\ secure\ interrupt\ CPU2\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IWDG1\ early\ wake\ Cid=1
RIF.RIFAWARE.EXTI2\ Feature\ IWDG1\ early\ wake\ CortexA35SFSBLA=true
RIF.RIFAWARE.EXTI2\ Feature\ IWDG1\ early\ wake\ CortexA35SSecureOS=true
RIF.RIFAWARE.EXTI2\ Feature\ IWDG1\ early\ wake\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ IWDG1\ early\ wake\ Secure=true
RIF.RIFAWARE.EXTI2\ Feature\ IWDG1\ reset\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ IWDG1\ reset\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ IWDG1\ reset\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IWDG2\ early\ wake\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ IWDG2\ early\ wake\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ IWDG2\ early\ wake\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IWDG2\ reset\ Cid=1
RIF.RIFAWARE.EXTI2\ Feature\ IWDG2\ reset\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ IWDG3\ early\ wake\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ IWDG3\ early\ wake\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ IWDG3\ early\ wake\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IWDG3\ reset\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ IWDG3\ reset\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ IWDG4\ early\ wake\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ IWDG4\ early\ wake\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IWDG4\ reset\ Cid=2
RIF.RIFAWARE.EXTI2\ Feature\ IWDG5\ early\ wake\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ IWDG5\ early\ wake\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ LPTIM3\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ LPTIM3\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ LPTIM3\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ LPTIM4\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ LPTIM4\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ LPTIM4\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ LPTIM5\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ LPTIM5\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ LPTIM5\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ LPUART1\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ LPUART1\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ RETRAM\ CRC\ error\ wakeup\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ RETRAM\ CRC\ error\ wakeup\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ RETRAM\ CRC\ error\ wakeup\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ RTC\ global\ non\ secure\ Wakeup\ CPU1\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ RTC\ global\ non\ secure\ Wakeup\ CPU1\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ RTC\ global\ non\ secure\ Wakeup\ CPU1\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ RTC\ global\ non\ secure\ Wakeup\ CPU2\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ RTC\ global\ non\ secure\ Wakeup\ CPU2\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ RTC\ global\ secure\ Wakeup\ CPU1\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ RTC\ global\ secure\ Wakeup\ CPU1\ Privilege=true
