STMicroelectronics/STM32_open_pin_data/boards/M33_Evaluation_Board_STM32MP257F-EV1_STM32MP257FAI_Board_AllConfig.ioc
RIF.RIFAWARE.EXTI2\ Feature\ RTC\ global\ secure\ Wakeup\ CPU1\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ RTC\ global\ secure\ Wakeup\ CPU2\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ RTC\ global\ secure\ Wakeup\ CPU2\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ RTC\ global\ secure\ Wakeup\ CPU2\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ SPI8\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ SPI8\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ SPI8\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ TAMP\ non\ secure\ tamper\ CPU1\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ TAMP\ non\ secure\ tamper\ CPU1\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ TAMP\ non\ secure\ tamper\ CPU1\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ TAMP\ non\ secure\ tamper\ CPU2\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ TAMP\ non\ secure\ tamper\ CPU2\ Privilege=false
RIF.RIFAWARE.EXTI2\ Feature\ TAMP\ non\ secure\ tamper\ CPU2\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ TAMP\ non\ secure\ tamper\ CPU3\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ TAMP\ non\ secure\ tamper\ CPU3\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ TAMP\ secure\ tamper\ CPU1\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ TAMP\ secure\ tamper\ CPU1\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ TAMP\ secure\ tamper\ CPU1\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ TAMP\ secure\ tamper\ CPU2\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ TAMP\ secure\ tamper\ CPU2\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ TAMP\ secure\ tamper\ CPU2\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ VDDCORE_VD\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ VDDCORE_VD\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ VDDCORE_VD\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ VDDCPU_VD\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ VDDCPU_VD\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ VDDCPU_VD\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ WWDG2\ reset\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ WWDG2\ reset\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ lpdma1_ch0123_CPU1_irq\ Cid=1
RIF.RIFAWARE.EXTI2\ Feature\ lpdma1_ch0123_CPU1_irq\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ lpdma1_ch0123_CPU2_irq\ Cid=2
RIF.RIFAWARE.EXTI2\ Feature\ lpdma1_ch0123_CPU2_irq\ Privilege=true
RIF.RIFAWARE.EXTI2\ Feature\ lpdma1_ch0123_CPU3_irq\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ lpdma1_ch0123_CPU3_irq\ Secure=false
RIF.RIFAWARE.FMC\ Feature\ FMC_CFGR\ Cid=-
RIF.RIFAWARE.FMC\ Feature\ FMC_CFGR\ Secure=false
RIF.RIFAWARE.FMC\ Feature\ FMC_NAND\ Cid=-
RIF.RIFAWARE.FMC\ Feature\ FMC_NAND\ Secure=false
RIF.RIFAWARE.FMC\ Feature\ FMC_NOR/PSRAM1\ Cid=-
RIF.RIFAWARE.FMC\ Feature\ FMC_NOR/PSRAM1\ Secure=false
RIF.RIFAWARE.FMC\ Feature\ FMC_NOR/PSRAM2\ Cid=-
RIF.RIFAWARE.FMC\ Feature\ FMC_NOR/PSRAM2\ Secure=false
RIF.RIFAWARE.FMC\ Feature\ FMC_NOR/PSRAM3\ Cid=-
RIF.RIFAWARE.FMC\ Feature\ FMC_NOR/PSRAM3\ Secure=false
RIF.RIFAWARE.FMC\ Feature\ FMC_NOR/PSRAM4\ Cid=-
RIF.RIFAWARE.FMC\ Feature\ FMC_NOR/PSRAM4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA0\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PA0\ CortexA35SFSBLA=true
RIF.RIFAWARE.GPIO\ Feature\ PA0\ CortexA35SSecureOS=true
RIF.RIFAWARE.GPIO\ Feature\ PA0\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PA0\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PA1\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PA1\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PA1\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PA1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA10\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PA10\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PA10\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PA10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA11\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PA11\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PA11\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PA11\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PA11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA12\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PA12\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PA12\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PA12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA13\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PA13\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PA13\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PA13\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PA13\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA14\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PA14\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PA14\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PA14\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PA14\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA15\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PA15\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PA15\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PA15\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PA15\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA2\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PA2\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PA2\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PA2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA3\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PA3\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PA3\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PA3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA4\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PA4\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PA4\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PA4\ CortexA35SFSBLA=true
RIF.RIFAWARE.GPIO\ Feature\ PA4\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PA4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA5\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PA5\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PA5\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PA5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA6\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PA6\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PA6\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PA6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA7\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PA7\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PA7\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PA7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA8\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PA8\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PA8\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PA8\ CortexA35SFSBLA=true
RIF.RIFAWARE.GPIO\ Feature\ PA8\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PA8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA9\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PA9\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PA9\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PA9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB0\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PB0\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PB0\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB1\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PB1\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PB1\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PB1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB10\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PB10\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PB10\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PB10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB11\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PB11\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PB11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB12\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PB12\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PB12\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PB12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB13\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PB13\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PB13\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PB13\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB14\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PB14\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PB14\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PB14\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB15\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PB15\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PB15\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PB15\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB2\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PB2\ Privilege=false
RIF.RIFAWARE.GPIO\ Feature\ PB2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB3\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PB3\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PB3\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PB3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB4\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PB4\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PB4\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PB4\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PB4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB5\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PB5\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PB5\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PB5\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PB5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB6\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PB6\ Privilege=false
RIF.RIFAWARE.GPIO\ Feature\ PB6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB7\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PB7\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PB7\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PB7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB8\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PB8\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PB8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB9\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PB9\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PB9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC0\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PC0\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PC0\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PC0\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PC0\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC1\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PC1\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PC1\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PC1\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PC1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC10\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PC10\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PC10\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PC10\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PC10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC11\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PC11\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PC11\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PC11\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PC11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC12\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PC12\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PC12\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PC12\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PC12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC13\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PC13\ Privilege=false
RIF.RIFAWARE.GPIO\ Feature\ PC13\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC2\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PC2\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PC2\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PC2\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PC2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC3\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PC3\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PC3\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PC3\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PC3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC4\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PC4\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PC4\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PC4\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PC4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC5\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PC5\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PC5\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PC5\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PC5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC6\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PC6\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PC6\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PC6\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PC6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC7\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PC7\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PC7\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PC7\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PC7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC8\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PC8\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PC8\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PC8\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PC8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC9\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PC9\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PC9\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PC9\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PC9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD0\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD0\ CortexA35SSecureOS=true
RIF.RIFAWARE.GPIO\ Feature\ PD0\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PD0\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PD1\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PD1\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PD1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD10\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD10\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PD10\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PD10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD11\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD11\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PD11\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PD11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD12\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD12\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PD12\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PD12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD13\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD13\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PD13\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PD13\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD14\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD14\ CortexA35SFSBLA=true
RIF.RIFAWARE.GPIO\ Feature\ PD14\ CortexA35SSecureOS=true
RIF.RIFAWARE.GPIO\ Feature\ PD14\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PD14\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PD15\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD15\ CortexA35SFSBLA=true
RIF.RIFAWARE.GPIO\ Feature\ PD15\ CortexA35SSecureOS=true
RIF.RIFAWARE.GPIO\ Feature\ PD15\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PD15\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PD2\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PD2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD3\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD3\ CortexA35SSecureOS=true
RIF.RIFAWARE.GPIO\ Feature\ PD3\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PD3\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PD4\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD4\ CortexA35SSecureOS=true
RIF.RIFAWARE.GPIO\ Feature\ PD4\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PD4\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PD5\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD5\ CortexA35SSecureOS=true
RIF.RIFAWARE.GPIO\ Feature\ PD5\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PD5\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PD6\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD6\ CortexA35SSecureOS=true
RIF.RIFAWARE.GPIO\ Feature\ PD6\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PD6\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PD7\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD7\ CortexA35SSecureOS=true
RIF.RIFAWARE.GPIO\ Feature\ PD7\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PD7\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PD8\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD8\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PD8\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PD8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD9\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD9\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PD9\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PD9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE0\ BootROMA35=true
RIF.RIFAWARE.GPIO\ Feature\ PE0\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PE0\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PE0\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PE0\ CortexA35SFSBLA=true
RIF.RIFAWARE.GPIO\ Feature\ PE0\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PE0\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE1\ BootROMA35=true
RIF.RIFAWARE.GPIO\ Feature\ PE1\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PE1\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PE1\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PE1\ CortexA35SFSBLA=true
RIF.RIFAWARE.GPIO\ Feature\ PE1\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PE1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE10\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PE10\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PE10\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PE10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE11\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PE11\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PE11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE12\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PE12\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PE12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE13\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PE13\ Privilege=false
RIF.RIFAWARE.GPIO\ Feature\ PE13\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE14\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PE14\ Privilege=false
RIF.RIFAWARE.GPIO\ Feature\ PE14\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE15\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PE15\ Privilege=false
RIF.RIFAWARE.GPIO\ Feature\ PE15\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE2\ BootROMA35=true
RIF.RIFAWARE.GPIO\ Feature\ PE2\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PE2\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PE2\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PE2\ CortexA35SFSBLA=true
RIF.RIFAWARE.GPIO\ Feature\ PE2\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PE2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE3\ BootROMA35=true
RIF.RIFAWARE.GPIO\ Feature\ PE3\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PE3\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PE3\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PE3\ CortexA35SFSBLA=true
RIF.RIFAWARE.GPIO\ Feature\ PE3\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PE3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE4\ BootROMA35=true
RIF.RIFAWARE.GPIO\ Feature\ PE4\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PE4\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PE4\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PE4\ CortexA35SFSBLA=true
RIF.RIFAWARE.GPIO\ Feature\ PE4\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PE4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE5\ BootROMA35=true
RIF.RIFAWARE.GPIO\ Feature\ PE5\ Cid=1
