STMicroelectronics/STM32_open_pin_data/boards/M33_Evaluation_Board_STM32MP257F-EV1_STM32MP257FAI_Board_AllConfig.ioc
RIF.RIFAWARE.GPIO\ Feature\ PE5\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PE5\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PE5\ CortexA35SFSBLA=true
RIF.RIFAWARE.GPIO\ Feature\ PE5\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PE5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE6\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PE6\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PE6\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PE6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE7\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PE7\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PE7\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PE7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE8\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PE8\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PE8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE9\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PE9\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PE9\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PE9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF0\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PF0\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PF0\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PF0\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PF0\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF1\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PF1\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PF1\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PF1\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PF1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF10\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PF10\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PF10\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PF10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF11\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PF11\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PF11\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PF11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF12\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PF12\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PF12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF13\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PF13\ CortexM33SSecureOS=true
RIF.RIFAWARE.GPIO\ Feature\ PF13\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PF13\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PF14\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PF14\ CortexM33SSecureOS=true
RIF.RIFAWARE.GPIO\ Feature\ PF14\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PF14\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PF15\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PF15\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PF15\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PF15\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF2\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PF2\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PF2\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PF2\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PF2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF3\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PF3\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PF3\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PF3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF4\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PF4\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PF4\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PF4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF5\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PF5\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PF5\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PF5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF6\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PF6\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PF6\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PF6\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PF6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF7\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PF7\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PF7\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PF7\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PF7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF8\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PF8\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PF8\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PF8\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PF8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF9\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PF9\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PF9\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PF9\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PF9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG0\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG0\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG0\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PG0\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PG0\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG1\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG1\ CortexA35SFSBLA=true
RIF.RIFAWARE.GPIO\ Feature\ PG1\ CortexA35SSecureOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG1\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PG1\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PG10\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PG10\ CortexM33SSecureOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG10\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PG10\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PG11\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG11\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG11\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PG11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG12\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG12\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG12\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PG12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG13\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PG13\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PG13\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PG13\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG14\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG14\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG14\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PG14\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG15\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG15\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG15\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PG15\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG2\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG2\ CortexA35SFSBLA=true
RIF.RIFAWARE.GPIO\ Feature\ PG2\ CortexA35SSecureOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG2\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PG2\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PG3\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG3\ CortexA35SFSBLA=true
RIF.RIFAWARE.GPIO\ Feature\ PG3\ CortexA35SSecureOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG3\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PG3\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PG4\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG4\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG4\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PG4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG5\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG5\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG5\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PG5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG6\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG6\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG6\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PG6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG7\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG7\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG7\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PG7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG8\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG8\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG8\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PG8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG9\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PG9\ CortexM33SSecureOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG9\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PG9\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PH10\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PH10\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PH10\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PH10\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PH10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH11\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PH11\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PH11\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PH11\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PH11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH12\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PH12\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PH12\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PH12\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PH12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH13\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PH13\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PH13\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PH13\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PH13\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH2\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PH2\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PH2\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PH2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH3\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PH3\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PH3\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PH3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH4\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PH4\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PH4\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PH4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH5\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PH5\ CortexA35SFSBLA=true
RIF.RIFAWARE.GPIO\ Feature\ PH5\ CortexA35SSecureOS=true
RIF.RIFAWARE.GPIO\ Feature\ PH5\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PH5\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PH6\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PH6\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PH6\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PH6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH7\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PH7\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PH7\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PH7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH8\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PH8\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PH8\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PH8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH9\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PH9\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PH9\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PH9\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PH9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI0\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI0\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI0\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PI0\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI1\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PI1\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PI1\ Privilege=false
RIF.RIFAWARE.GPIO\ Feature\ PI1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI10\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI10\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI10\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PI10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI11\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI11\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI11\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PI11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI12\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI12\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI12\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PI12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI13\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI13\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI13\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PI13\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI14\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PI14\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PI14\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI15\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PI15\ Privilege=false
RIF.RIFAWARE.GPIO\ Feature\ PI15\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI2\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PI2\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PI2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI3\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI3\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI3\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PI3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI4\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI4\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI4\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PI4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI5\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI5\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI5\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PI5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI6\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI6\ CortexA35SFSBLA=true
RIF.RIFAWARE.GPIO\ Feature\ PI6\ CortexA35SSecureOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI6\ Privilege=false
RIF.RIFAWARE.GPIO\ Feature\ PI6\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PI7\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI7\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI7\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PI7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI8\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI8\ CortexA35SSecureOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI8\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PI8\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PI9\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI9\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI9\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PI9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ0\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PJ0\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PJ0\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PJ0\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PJ0\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ1\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PJ1\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PJ1\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PJ1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ10\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PJ10\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PJ10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ11\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PJ11\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PJ11\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PJ11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ12\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PJ12\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PJ12\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PJ12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ13\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PJ13\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PJ13\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PJ13\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ14\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PJ14\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PJ14\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PJ14\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ15\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PJ15\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PJ15\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PJ15\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ2\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PJ2\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PJ2\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PJ2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ3\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PJ3\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PJ3\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PJ3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ4\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PJ4\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PJ4\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PJ4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ5\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PJ5\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PJ5\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PJ5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ6\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PJ6\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PJ6\ Privilege=false
RIF.RIFAWARE.GPIO\ Feature\ PJ6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ7\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PJ7\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PJ7\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PJ7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ8\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PJ8\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PJ8\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PJ8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ9\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PJ9\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PJ9\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PJ9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PK0\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PK0\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PK0\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PK0\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PK1\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PK1\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PK1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PK2\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PK2\ Privilege=false
RIF.RIFAWARE.GPIO\ Feature\ PK2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PK3\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PK3\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PK3\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PK3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PK4\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PK4\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PK4\ Privilege=false
RIF.RIFAWARE.GPIO\ Feature\ PK4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PK5\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PK5\ Privilege=false
RIF.RIFAWARE.GPIO\ Feature\ PK5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PK6\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PK6\ Privilege=false
RIF.RIFAWARE.GPIO\ Feature\ PK6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PK7\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PK7\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PK7\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PK7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ0\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PZ0\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PZ0\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PZ0\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ1\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PZ1\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PZ1\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PZ1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ2\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PZ2\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PZ2\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PZ2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ3\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PZ3\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PZ3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ4\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PZ4\ Privilege=true
