STMicroelectronics/STM32_open_pin_data/boards/M33_Evaluation_Board_STM32MP257F-EV1_STM32MP257FAI_Board_AllConfig.ioc
RIF.RIFAWARE.GPIO\ Feature\ PZ4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ5\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PZ5\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PZ5\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PZ5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ6\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PZ6\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PZ6\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PZ6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ7\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PZ7\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PZ7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ8\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PZ8\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PZ8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ9\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PZ9\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PZ9\ Privilege=true
RIF.RIFAWARE.GPIO\ Feature\ PZ9\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 0\ Cid=1
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 0\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 0\ Privilege=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 0\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 1\ Cid=1
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 1\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 1\ Privilege=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 1\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 10\ Cid=1
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 10\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 10\ Privilege=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 10\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 11\ Cid=1
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 11\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 11\ Privilege=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 11\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 12\ Cid=1
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 12\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 12\ Privilege=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 12\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 13\ Cid=1
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 13\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 13\ Privilege=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 13\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 14\ Cid=1
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 14\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 14\ Privilege=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 14\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 15\ Cid=1
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 15\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 15\ Privilege=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 15\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 2\ Cid=1
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 2\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 2\ Privilege=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 2\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 3\ Cid=1
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 3\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 3\ Privilege=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 3\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 4\ Cid=1
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 4\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 4\ Privilege=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 4\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 5\ Cid=1
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 5\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 5\ Privilege=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 5\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 6\ Cid=1
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 6\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 6\ Privilege=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 6\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 7\ Cid=1
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 7\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 7\ Privilege=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 7\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 8\ Cid=1
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 8\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 8\ Privilege=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 8\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 9\ Cid=1
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 9\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 9\ Privilege=true
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 9\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 0\ Cid=1
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 0\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 0\ Privilege=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 0\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 1\ Cid=1
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 1\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 1\ Privilege=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 1\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 10\ Cid=1
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 10\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 10\ Privilege=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 10\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 11\ Cid=1
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 11\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 11\ Privilege=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 11\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 12\ Cid=1
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 12\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 12\ Privilege=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 12\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 13\ Cid=1
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 13\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 13\ Privilege=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 13\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 14\ Cid=1
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 14\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 14\ Privilege=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 14\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 15\ Cid=1
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 15\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 15\ Privilege=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 15\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 2\ Cid=1
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 2\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 2\ Privilege=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 2\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 3\ Cid=1
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 3\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 3\ Privilege=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 3\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 4\ Cid=1
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 4\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 4\ Privilege=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 4\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 5\ Cid=1
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 5\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 5\ Privilege=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 5\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 6\ Cid=1
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 6\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 6\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 7\ Cid=1
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 7\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 7\ Privilege=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 7\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 8\ Cid=1
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 8\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 8\ Privilege=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 8\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 9\ Cid=1
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 9\ CortexA35NSOS=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 9\ Privilege=true
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 9\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 0\ Cid=2
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 0\ CortexM33NS=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 0\ Privilege=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 0\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 1\ Cid=2
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 1\ CortexM33NS=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 1\ Privilege=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 1\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 10\ Cid=2
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 10\ CortexM33NS=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 10\ Privilege=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 10\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 11\ Cid=2
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 11\ CortexM33NS=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 11\ Privilege=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 11\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 12\ Cid=2
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 12\ CortexM33NS=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 12\ Privilege=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 12\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 13\ Cid=2
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 13\ CortexM33NS=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 13\ Privilege=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 13\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 14\ Cid=2
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 14\ CortexM33NS=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 14\ Privilege=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 14\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 15\ Cid=2
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 15\ CortexM33NS=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 15\ Privilege=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 15\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 2\ Cid=2
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 2\ CortexM33NS=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 2\ Privilege=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 2\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 3\ Cid=2
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 3\ CortexM33NS=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 3\ Privilege=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 3\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 4\ Cid=2
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 4\ CortexM33NS=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 4\ Privilege=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 4\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 5\ Cid=2
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 5\ CortexM33NS=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 5\ Privilege=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 5\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 6\ Cid=2
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 6\ CortexM33NS=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 6\ Privilege=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 6\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 7\ Cid=2
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 7\ CortexM33NS=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 7\ Privilege=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 7\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 8\ Cid=2
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 8\ CortexM33NS=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 8\ Privilege=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 8\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 9\ Cid=2
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 9\ CortexM33NS=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 9\ Privilege=true
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 9\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 0\ Semaphore\ 0\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 0\ Semaphore\ 0\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 0\ Semaphore\ 1\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 0\ Semaphore\ 1\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 0\ Semaphore\ 2\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 0\ Semaphore\ 2\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 0\ Semaphore\ 3\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 0\ Semaphore\ 3\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 1\ Semaphore\ 4\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 1\ Semaphore\ 4\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 1\ Semaphore\ 5\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 1\ Semaphore\ 5\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 1\ Semaphore\ 6\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 1\ Semaphore\ 6\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 1\ Semaphore\ 7\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 1\ Semaphore\ 7\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 2\ Semaphore\ 10\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 2\ Semaphore\ 10\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 2\ Semaphore\ 11\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 2\ Semaphore\ 11\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 2\ Semaphore\ 8\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 2\ Semaphore\ 8\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 2\ Semaphore\ 9\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 2\ Semaphore\ 9\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 3\ Semaphore\ 12\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 3\ Semaphore\ 12\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 3\ Semaphore\ 13\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 3\ Semaphore\ 13\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 3\ Semaphore\ 14\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 3\ Semaphore\ 14\ Secure=false
RIF.RIFAWARE.HSEM\ Feature\ Group\ 3\ Semaphore\ 15\ Cid=-
RIF.RIFAWARE.HSEM\ Feature\ Group\ 3\ Semaphore\ 15\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 1\ Cid=1
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 1\ CortexA35NSOS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 1\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 10\ Cid=1
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 10\ CortexA35NSOS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 10\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 11\ Cid=1
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 11\ CortexA35NSOS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 11\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 12\ Cid=1
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 12\ CortexA35NSOS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 12\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 13\ Cid=1
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 13\ CortexA35NSOS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 13\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 14\ Cid=1
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 14\ CortexA35NSOS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 14\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 15\ Cid=1
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 15\ CortexA35NSOS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 15\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 16\ Cid=1
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 16\ CortexA35NSOS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 16\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 2\ Cid=1
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 2\ CortexA35NSOS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 2\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 3\ Cid=1
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 3\ CortexA35NSOS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 3\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 4\ Cid=1
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 4\ CortexA35NSOS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 4\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 5\ Cid=1
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 5\ CortexA35NSOS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 5\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 6\ Cid=1
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 6\ CortexA35NSOS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 6\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 7\ Cid=1
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 7\ CortexA35NSOS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 7\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 8\ Cid=1
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 8\ CortexA35NSOS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 8\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 9\ Cid=1
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 9\ CortexA35NSOS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU1\ channel\ 9\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 1\ Cid=2
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 1\ CortexM33NS=true
