STMicroelectronics/STM32_open_pin_data/boards/M33_Evaluation_Board_STM32MP257F-EV1_STM32MP257FAI_Board_AllConfig.ioc
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 1\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 10\ Cid=2
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 10\ CortexM33NS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 10\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 11\ Cid=2
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 11\ CortexM33NS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 11\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 12\ Cid=2
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 12\ CortexM33NS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 12\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 13\ Cid=2
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 13\ CortexM33NS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 13\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 14\ Cid=2
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 14\ CortexM33NS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 14\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 15\ Cid=2
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 15\ CortexM33NS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 15\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 16\ Cid=2
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 16\ CortexM33NS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 16\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 2\ Cid=2
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 2\ CortexM33NS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 2\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 3\ Cid=2
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 3\ CortexM33NS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 3\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 4\ Cid=2
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 4\ CortexM33NS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 4\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 5\ Cid=2
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 5\ CortexM33NS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 5\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 6\ Cid=2
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 6\ CortexM33NS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 6\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 7\ Cid=2
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 7\ CortexM33NS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 7\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 8\ Cid=2
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 8\ CortexM33NS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 8\ Secure=false
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 9\ Cid=2
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 9\ CortexM33NS=true
RIF.RIFAWARE.IPCC1\ Feature\ CPU2\ channel\ 9\ Secure=false
RIF.RIFAWARE.LTDC\ Feature\ LTDC_CMN\ Cid=1
RIF.RIFAWARE.LTDC\ Feature\ LTDC_CMN\ CortexA35NSOS=true
RIF.RIFAWARE.LTDC\ Feature\ LTDC_CMN\ CortexA35NSSSBL=true
RIF.RIFAWARE.LTDC\ Feature\ LTDC_CMN\ CortexA35SSecureOS=false
RIF.RIFAWARE.LTDC\ Feature\ LTDC_CMN\ Secure=false
RIF.RIFAWARE.LTDC\ Feature\ LTDC_L0L1\ Cid=1
RIF.RIFAWARE.LTDC\ Feature\ LTDC_L0L1\ CortexA35NSOS=true
RIF.RIFAWARE.LTDC\ Feature\ LTDC_L0L1\ CortexA35NSSSBL=true
RIF.RIFAWARE.LTDC\ Feature\ LTDC_L0L1\ Secure=false
RIF.RIFAWARE.LTDC\ Feature\ LTDC_L2\ Cid=1
RIF.RIFAWARE.LTDC\ Feature\ LTDC_L2\ CortexA35NSOS=true
RIF.RIFAWARE.LTDC\ Feature\ LTDC_L2\ CortexA35NSSSBL=true
RIF.RIFAWARE.LTDC\ Feature\ LTDC_L2\ CortexA35SSecureOS=false
RIF.RIFAWARE.LTDC\ Feature\ LTDC_L2\ Secure=false
RIF.RIFAWARE.LTDC\ Feature\ LTDC_ROT\ Cid=1
RIF.RIFAWARE.LTDC\ Feature\ LTDC_ROT\ CortexA35NSOS=true
RIF.RIFAWARE.LTDC\ Feature\ LTDC_ROT\ CortexA35NSSSBL=true
RIF.RIFAWARE.LTDC\ Feature\ LTDC_ROT\ Secure=false
RIF.RIFAWARE.PWR\ Feature\ CPU1\ power\ control\ BootROMA35=true
RIF.RIFAWARE.PWR\ Feature\ CPU1\ power\ control\ Cid=1
RIF.RIFAWARE.PWR\ Feature\ CPU1\ power\ control\ CortexA35SFSBLA=true
RIF.RIFAWARE.PWR\ Feature\ CPU1\ power\ control\ CortexA35SSecureOS=true
RIF.RIFAWARE.PWR\ Feature\ CPU1\ power\ control\ Privilege=true
RIF.RIFAWARE.PWR\ Feature\ CPU1\ power\ control\ Secure=true
RIF.RIFAWARE.PWR\ Feature\ CPU2\ power\ control\ Cid=1
RIF.RIFAWARE.PWR\ Feature\ CPU2\ power\ control\ CortexA35NSOS=false
RIF.RIFAWARE.PWR\ Feature\ CPU2\ power\ control\ CortexA35SSecureOS=true
RIF.RIFAWARE.PWR\ Feature\ CPU2\ power\ control\ CortexM33NS=false
RIF.RIFAWARE.PWR\ Feature\ CPU2\ power\ control\ CortexM33SSecureOS=false
RIF.RIFAWARE.PWR\ Feature\ CPU2\ power\ control\ Privilege=true
RIF.RIFAWARE.PWR\ Feature\ CPU2\ power\ control\ Secure=true
RIF.RIFAWARE.PWR\ Feature\ CPU3\ power\ control\ Cid=1
RIF.RIFAWARE.PWR\ Feature\ CPU3\ power\ control\ CortexA35SSecureOS=true
RIF.RIFAWARE.PWR\ Feature\ CPU3\ power\ control\ Privilege=true
RIF.RIFAWARE.PWR\ Feature\ CPU3\ power\ control\ Secure=true
RIF.RIFAWARE.PWR\ Feature\ RAM\ and\ low\ power\ Cid=1
RIF.RIFAWARE.PWR\ Feature\ RAM\ and\ low\ power\ CortexA35SFSBLA=true
RIF.RIFAWARE.PWR\ Feature\ RAM\ and\ low\ power\ CortexA35SSecureOS=true
RIF.RIFAWARE.PWR\ Feature\ RAM\ and\ low\ power\ Privilege=true
RIF.RIFAWARE.PWR\ Feature\ RAM\ and\ low\ power\ Secure=true
RIF.RIFAWARE.PWR\ Feature\ VDD\ SD\ Cid=1
RIF.RIFAWARE.PWR\ Feature\ VDD\ SD\ CortexA35SSecureOS=true
RIF.RIFAWARE.PWR\ Feature\ VDD\ SD\ Privilege=true
RIF.RIFAWARE.PWR\ Feature\ VDD\ SD\ Secure=true
RIF.RIFAWARE.PWR\ Feature\ VDD\ eMMC\ Cid=1
RIF.RIFAWARE.PWR\ Feature\ VDD\ eMMC\ CortexA35SSecureOS=true
RIF.RIFAWARE.PWR\ Feature\ VDD\ eMMC\ Privilege=true
RIF.RIFAWARE.PWR\ Feature\ VDD\ eMMC\ Secure=true
RIF.RIFAWARE.PWR\ Feature\ Voltage\ monitoring\ Cid=1
RIF.RIFAWARE.PWR\ Feature\ Voltage\ monitoring\ CortexA35SFSBLA=true
RIF.RIFAWARE.PWR\ Feature\ Voltage\ monitoring\ CortexA35SSecureOS=true
RIF.RIFAWARE.PWR\ Feature\ Voltage\ monitoring\ Privilege=true
RIF.RIFAWARE.PWR\ Feature\ Voltage\ monitoring\ Secure=true
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 1\ Cid=1
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 1\ CortexA35NSOS=true
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 1\ CortexA35SSecureOS=false
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 1\ Privilege=true
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 1\ Secure=false
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 2\ Cid=1
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 2\ CortexA35NSOS=true
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 2\ CortexA35SSecureOS=false
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 2\ Privilege=true
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 2\ Secure=false
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 3\ Cid=2
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 3\ CortexA35SSecureOS=false
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 3\ CortexM33NS=true
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 3\ Secure=false
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 4\ Cid=-
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 4\ CortexA35SSecureOS=false
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 4\ Secure=false
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 5\ Cid=-
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 5\ CortexA35SSecureOS=false
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 5\ Secure=false
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 6\ Cid=-
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 6\ CortexA35SSecureOS=false
RIF.RIFAWARE.PWR\ Feature\ Wake\ up\ 6\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ BKPSRAM_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ BKPSRAM_CFGR\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ BKPSRAM_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ BOOT_STDB\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ BOOT_STDB\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ BOOT_STDB\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ BOOT_STDB\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ BOOT_STDB\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ BSEC_CFGR\ BootROMA35=true
RIF.RIFAWARE.RCC\ Feature\ BSEC_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ BSEC_CFGR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ BSEC_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_CPU1_EXT2F\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_CPU1_EXT2F\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_CPU1_EXT2F\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_CPU1_EXT2F\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_DDR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_DDR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_DDR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_DISPLAY\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_DISPLAY\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_DISPLAY\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_DISPLAY\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_HSL\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_HSL\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_HSL\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_HSL\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_HS_MCU\\nCK_ICN_LS_MCU\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_HS_MCU\\nCK_ICN_LS_MCU\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_HS_MCU\\nCK_ICN_LS_MCU\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_HS_MCU\\nCK_ICN_LS_MCU\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_M_GPU\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_M_GPU\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_M_GPU\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_M_GPU\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_NIC\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_NIC\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_NIC\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_SDMMC\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_SDMMC\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_SDMMC\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_SDMMC\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_VID\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_VID\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_VID\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_ICN_VID\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ADC12\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ADC12\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ADC12\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ADC3\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ADC3\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ADC3\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ADC3\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ADF1\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ADF1\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ADF1\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_CSIPHY\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_CSIPHY\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_CSIPHY\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_CSIPHY\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_CSITXESC\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_CSITXESC\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_CSITXESC\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_CSITXESC\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_DCMIPP\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_DCMIPP\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_DCMIPP\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_DCMIPP\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_DSIPHY\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_DSIPHY\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_DSIPHY\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETH1PTP\\nCK_KER_ETH2PTP\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETH1PTP\\nCK_KER_ETH2PTP\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETH1PTP\\nCK_KER_ETH2PTP\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETH1PTP\\nCK_KER_ETH2PTP\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETH1\\nCK_KER_ETHSW\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETH1\\nCK_KER_ETHSW\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETH1\\nCK_KER_ETHSW\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETH1\\nCK_KER_ETHSW\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETH2\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETH2\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETH2\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETH2\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETHSWREF\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETHSWREF\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETHSWREF\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_ETHSWREF\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_FDCAN\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_FDCAN\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_FDCAN\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_FMC\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_FMC\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_FMC\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C1,2\\nCK_KER_I3C1,2\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C1,2\\nCK_KER_I3C1,2\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C1,2\\nCK_KER_I3C1,2\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C1,2\\nCK_KER_I3C1,2\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C3,5\\nCK_KER_I3C3\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C3,5\\nCK_KER_I3C3\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C3,5\\nCK_KER_I3C3\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C4,6\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C4,6\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C4,6\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C7\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C7\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C7\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C7\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C8\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C8\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I2C8\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I3C4\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I3C4\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_I3C4\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LPTIM1,2\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LPTIM1,2\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LPTIM1,2\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LPTIM1,2\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LPTIM3\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LPTIM3\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LPTIM3\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LPTIM4,5\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LPTIM4,5\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LPTIM4,5\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LPUART1\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LPUART1\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LPUART1\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LTDC\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LTDC\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LTDC\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LTDC\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LVDSPHY\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LVDSPHY\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_LVDSPHY\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_OSPI1\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_OSPI1\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_OSPI1\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_OSPI2\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_OSPI2\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_OSPI2\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_OSPI2\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SAI1\\nCK_KER_MDF1\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SAI1\\nCK_KER_MDF1\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SAI1\\nCK_KER_MDF1\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SAI2\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SAI2\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SAI2\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SAI3,4\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SAI3,4\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SAI3,4\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SDMMC1\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SDMMC1\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SDMMC1\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SDMMC1\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SDMMC2\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SDMMC2\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SDMMC2\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SDMMC3\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SDMMC3\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SDMMC3\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPDIFRX\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPDIFRX\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPDIFRX\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI1\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI1\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI1\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI2,3\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI2,3\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI2,3\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI4,5\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI4,5\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI4,5\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI6,7\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI6,7\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI6,7\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI8\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI8\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_SPI8\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_STGEN\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_STGEN\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_STGEN\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_STGEN\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_TPIU\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_TPIU\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_TPIU\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_TPIU\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_TSDBG\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_TSDBG\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_TSDBG\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_TSDBG\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_UART7,8\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_UART7,8\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_UART7,8\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_UART9\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_UART9\ Privilege=true
