STMicroelectronics/STM32_open_pin_data/boards/M33_Evaluation_Board_STM32MP257F-EV1_STM32MP257FAI_Board_AllConfig.ioc
RIF.RIFAWARE.RCC\ Feature\ CK_KER_UART9\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART1\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART1\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART1\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART2,4\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART2,4\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART2,4\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART2,4\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART3,5\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART3,5\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART3,5\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART3,5\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART6\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART6\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART6\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USART6\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USB2PHY1\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USB2PHY1\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USB2PHY1\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USB2PHY1\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USB2PHY2\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USB2PHY2\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USB2PHY2\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USB2PHY2\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USB3PCIEPHY\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USB3PCIEPHY\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USB3PCIEPHY\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USB3PCIEPHY\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USBTC\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USBTC\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USBTC\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_KER_USBTC\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_MCO1\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_MCO1\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_MCO1\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_MCO1\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_MCO2\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_MCO2\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_MCO2\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_MCO2\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_SYS_ATB\\nCK_ICN_M_ETR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_SYS_ATB\\nCK_ICN_M_ETR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_SYS_ATB\\nCK_ICN_M_ETR\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_SYS_ATB\\nCK_ICN_M_ETR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CK_SYS_PLL4,5,6,7,8\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CK_SYS_PLL4,5,6,7,8\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CK_SYS_PLL4,5,6,7,8\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CK_SYS_PLL4,5,6,7,8\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CPU1_RES\ BootROMA35=true
RIF.RIFAWARE.RCC\ Feature\ CPU1_RES\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CPU1_RES\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ CPU1_RES\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CPU1_RES\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CPU1_RES\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ CPU2_RES\ Cid=1&2
RIF.RIFAWARE.RCC\ Feature\ CPU2_RES\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CPU2_RES\ CortexM33NS=true
RIF.RIFAWARE.RCC\ Feature\ CPU2_RES\ CortexM33SSecureOS=false
RIF.RIFAWARE.RCC\ Feature\ CPU2_RES\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CPU2_RES\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ CPU3_RES\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ CPU3_RES\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ CPU3_RES\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ CPU3_RES\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ DDRC_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ DDRC_CFGR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ DDRC_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ DEBUG_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ DEBUG_CFGR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ DEBUG_CFGR\ CortexM33SSecureOS=false
RIF.RIFAWARE.RCC\ Feature\ DEBUG_CFGR\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ DEBUG_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ FCALC\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ FCALC\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ FCALC\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ FCALC\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ FMC_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ FMC_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ GPIOA_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ GPIOA_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOA_CFGR\ CortexA35NSSSBL=true
RIF.RIFAWARE.RCC\ Feature\ GPIOA_CFGR\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ GPIOA_CFGR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOA_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ GPIOB_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ GPIOB_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOB_CFGR\ CortexA35NSSSBL=true
RIF.RIFAWARE.RCC\ Feature\ GPIOB_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ GPIOC_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ GPIOC_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOC_CFGR\ CortexA35NSSSBL=true
RIF.RIFAWARE.RCC\ Feature\ GPIOC_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ GPIOD_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ GPIOD_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOD_CFGR\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ GPIOD_CFGR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOD_CFGR\ Lock=false
RIF.RIFAWARE.RCC\ Feature\ GPIOD_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ GPIOE_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ GPIOE_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOE_CFGR\ CortexA35NSSSBL=true
RIF.RIFAWARE.RCC\ Feature\ GPIOE_CFGR\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ GPIOE_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ GPIOF_CFGR\ Cid=1&2
RIF.RIFAWARE.RCC\ Feature\ GPIOF_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOF_CFGR\ CortexA35NSSSBL=true
RIF.RIFAWARE.RCC\ Feature\ GPIOF_CFGR\ CortexM33NS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOF_CFGR\ CortexM33SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOF_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ GPIOG_CFGR\ Cid=1&2
RIF.RIFAWARE.RCC\ Feature\ GPIOG_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOG_CFGR\ CortexA35NSSSBL=true
RIF.RIFAWARE.RCC\ Feature\ GPIOG_CFGR\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ GPIOG_CFGR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOG_CFGR\ CortexM33NS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOG_CFGR\ CortexM33SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOG_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ GPIOH_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ GPIOH_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOH_CFGR\ CortexA35NSSSBL=true
RIF.RIFAWARE.RCC\ Feature\ GPIOH_CFGR\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ GPIOH_CFGR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOH_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ GPIOI_CFGR\ Cid=1&2
RIF.RIFAWARE.RCC\ Feature\ GPIOI_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOI_CFGR\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ GPIOI_CFGR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOI_CFGR\ CortexM33NS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOI_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ GPIOJ_CFGR\ Cid=1&2
RIF.RIFAWARE.RCC\ Feature\ GPIOJ_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOJ_CFGR\ CortexA35NSSSBL=true
RIF.RIFAWARE.RCC\ Feature\ GPIOJ_CFGR\ CortexM33NS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOJ_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ GPIOK_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ GPIOK_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOK_CFGR\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ GPIOK_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ GPIOZ_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ GPIOZ_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOZ_CFGR\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ GPIOZ_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ HPDMA1_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ HPDMA1_CFGR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ HPDMA1_CFGR\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ HPDMA1_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ HPDMA2_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ HPDMA2_CFGR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ HPDMA2_CFGR\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ HPDMA2_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ HPDMA3_CFGR\ Cid=2
RIF.RIFAWARE.RCC\ Feature\ HPDMA3_CFGR\ CortexM33SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ HPDMA3_CFGR\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ HPDMA3_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ HSEM_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ HSEM_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ HSI_MON\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ HSI_MON\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ HSI_MON\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ IPCC1_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ IPCC1_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ IPCC2_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ IPCC2_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ LPDMA_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ LPDMA_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ LPSRAM1_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ LPSRAM1_CFGR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ LPSRAM1_CFGR\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ LPSRAM1_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ LPSRAM2_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ LPSRAM2_CFGR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ LPSRAM2_CFGR\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ LPSRAM2_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ LPSRAM3_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ LPSRAM3_CFGR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ LPSRAM3_CFGR\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ LPSRAM3_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ MCO1_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ MCO1_CFGR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ MCO1_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ MCO2_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ MCO2_CFGR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ MCO2_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ OSPI1_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ OSPI1_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ OSPI2_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ OSPI2_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ PLL3_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ PLL3_CFGR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ PLL3_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ RCC_FMCCFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ RCC_FMCCFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ RDCR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ RDCR\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ RDCR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ RDCR\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ RDCR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ RETRAM_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ RETRAM_CFGR\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ RETRAM_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ RTC_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ RTC_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ RTC_CFGR\ CortexA35SFSBLA=false
RIF.RIFAWARE.RCC\ Feature\ RTC_CFGR\ CortexA35SSecureOS=false
RIF.RIFAWARE.RCC\ Feature\ RTC_CFGR\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ RTC_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ SRAM1_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ SRAM1_CFGR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ SRAM1_CFGR\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ SRAM1_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ SRAM2_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ SRAM2_CFGR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ SRAM2_CFGR\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ SRAM2_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ SYSCLK\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ SYSCLK\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ SYSCLK\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ SYSCLK\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ SYSCLK\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ SYSCPU1_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ SYSCPU1_CFGR\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ SYSCPU1_CFGR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ SYSCPU1_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ SYSRAM_CFGR\ BootROMA35=true
RIF.RIFAWARE.RCC\ Feature\ SYSRAM_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ SYSRAM_CFGR\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ SYSRAM_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ SYSRST\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ SYSRST\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ SYSRST\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ SYSRST\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ SYSRST\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ VDERAM_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ VDERAM_CFGR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ VDERAM_CFGR\ Privilege=true
RIF.RIFAWARE.RCC\ Feature\ VDERAM_CFGR\ Secure=true
RIF.RIFAWARE.RTC\ Feature\ Alarm\ A\ Cid=1
RIF.RIFAWARE.RTC\ Feature\ Alarm\ A\ CortexA35NSOS=true
RIF.RIFAWARE.RTC\ Feature\ Alarm\ A\ CortexA35SSecureOS=false
RIF.RIFAWARE.RTC\ Feature\ Alarm\ A\ Privilege=true
RIF.RIFAWARE.RTC\ Feature\ Alarm\ A\ Secure=false
RIF.RIFAWARE.RTC\ Feature\ Alarm\ B\ Cid=2
RIF.RIFAWARE.RTC\ Feature\ Alarm\ B\ CortexA35NSOS=false
RIF.RIFAWARE.RTC\ Feature\ Alarm\ B\ CortexM33NS=true
RIF.RIFAWARE.RTC\ Feature\ Alarm\ B\ CortexM33SSecureOS=false
RIF.RIFAWARE.RTC\ Feature\ Alarm\ B\ Secure=false
RIF.RIFAWARE.RTC\ Feature\ Calibration\ Cid=1
RIF.RIFAWARE.RTC\ Feature\ Calibration\ CortexA35NSOS=true
RIF.RIFAWARE.RTC\ Feature\ Calibration\ CortexA35SSecureOS=false
RIF.RIFAWARE.RTC\ Feature\ Calibration\ Privilege=true
RIF.RIFAWARE.RTC\ Feature\ Calibration\ Secure=false
RIF.RIFAWARE.RTC\ Feature\ Initialization\ Cid=1
RIF.RIFAWARE.RTC\ Feature\ Initialization\ CortexA35NSOS=true
RIF.RIFAWARE.RTC\ Feature\ Initialization\ CortexA35SFSBLA=false
RIF.RIFAWARE.RTC\ Feature\ Initialization\ CortexA35SSecureOS=false
RIF.RIFAWARE.RTC\ Feature\ Initialization\ Privilege=true
RIF.RIFAWARE.RTC\ Feature\ Initialization\ Secure=false
RIF.RIFAWARE.RTC\ Feature\ Timestamp\ Cid=1
RIF.RIFAWARE.RTC\ Feature\ Timestamp\ CortexA35NSOS=true
RIF.RIFAWARE.RTC\ Feature\ Timestamp\ CortexA35SSecureOS=false
RIF.RIFAWARE.RTC\ Feature\ Timestamp\ Privilege=true
RIF.RIFAWARE.RTC\ Feature\ Timestamp\ Secure=false
RIF.RIFAWARE.RTC\ Feature\ Wakeup\ timer\ Cid=1
RIF.RIFAWARE.RTC\ Feature\ Wakeup\ timer\ CortexA35NSOS=true
RIF.RIFAWARE.RTC\ Feature\ Wakeup\ timer\ CortexA35SSecureOS=false
RIF.RIFAWARE.RTC\ Feature\ Wakeup\ timer\ Privilege=true
RIF.RIFAWARE.RTC\ Feature\ Wakeup\ timer\ Secure=false
RIF.RIFAWARE.TAMP\ End\ Address=1174471424
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 0\ Cid=1
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 0\ CortexA35SSecureOS=true
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 0\ Privilege=true
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 0\ Secure=true
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 1\ BootROMA35=true
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 1\ Cid=1
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 1\ CortexA35SFSBLA=true
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 1\ CortexA35SSecureOS=true
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 1\ Privilege=true
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 1\ Secure=true
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 2\ Cid=2
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 2\ CortexM33SSecureOS=true
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 2\ Privilege=true
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 2\ Secure=true
RIF.RIFAWARE.TAMP\ Size=512
RIF.RIFAWARE.TAMP\ Start\ Address=1174470912
RIF.RIFAWARE.Zone1-RIF1\ End\ Address=1174471008
RIF.RIFAWARE.Zone1-RIF1\ Size=96
RIF.RIFAWARE.Zone1-RIF1\ Start\ Address=1174470912
RIF.RIFAWARE.Zone1-RIF2\ End\ Address=1174471104
RIF.RIFAWARE.Zone1-RIF2\ Size=96
RIF.RIFAWARE.Zone1-RIF2\ Start\ Address=1174471008
RIF.RIFAWARE.Zone2-RIF1\ End\ Address=1174471200
RIF.RIFAWARE.Zone2-RIF1\ Size=96
RIF.RIFAWARE.Zone2-RIF1\ Start\ Address=1174471104
RIF.RIFAWARE.Zone2-RIF2\ End\ Address=1174471296
RIF.RIFAWARE.Zone2-RIF2\ Size=96
RIF.RIFAWARE.Zone2-RIF2\ Start\ Address=1174471200
RIF.RIFAWARE.Zone3-RIF0\ End\ Address=1174471392
RIF.RIFAWARE.Zone3-RIF0\ Size=48
RIF.RIFAWARE.Zone3-RIF0\ Start\ Address=1174471344
RIF.RIFAWARE.Zone3-RIF1\ End\ Address=1174471344
RIF.RIFAWARE.Zone3-RIF1\ Size=48
RIF.RIFAWARE.Zone3-RIF1\ Start\ Address=1174471296
RIF.RIFAWARE.Zone3-RIF2\ End\ Address=1174471424
RIF.RIFAWARE.Zone3-RIF2\ Size=32
RIF.RIFAWARE.Zone3-RIF2\ Start\ Address=1174471392
RIF.RISAF_BKPSRAM_Region1_Name=bl31_lowpower
RIF.RISAF_BKPSRAM_Region1_Secured=true
RIF.RISAF_BKPSRAM_Region2_Secured=true
RIF.RISAF_BKPSRAM_Region_ID_1_Master_CID1_Privilege=true
RIF.RISAF_BKPSRAM_Region_ID_1_Master_CID1_Read=true
RIF.RISAF_BKPSRAM_Region_ID_1_Master_CID1_Write=true
RIF.RISAF_BKPSRAM_Region_ID_2_Master_CID2_Privilege=true
RIF.RISAF_BKPSRAM_Region_ID_2_Master_CID2_Read=true
RIF.RISAF_BKPSRAM_Region_ID_2_Master_CID2_Write=true
RIF.RISAF_DDR11_Region_Size=0x0
RIF.RISAF_DDR11_Region_Size_4GO=0x0
RIF.RISAF_DDR12_Region_Size=0x0
RIF.RISAF_DDR12_Region_Size_4GO=0x0
RIF.RISAF_DDR14_Region_Size=0x1000000
RIF.RISAF_DDR14_Region_Size_4GO=0x1000000
RIF.RISAF_DDR6_Region_Size=0xCC0000
RIF.RISAF_DDR6_Region_Size_4GO=0xcc0000
RIF.RISAF_DDR7_Region_Size=0x40000
RIF.RISAF_DDR9_Region_Size=0x76800000
RIF.RISAF_DDR9_Region_Size_4GO=0x76800000
RIF.RISAF_DDR_End_Address=0x180000000
RIF.RISAF_DDR_Region15_Name=\ linuxkernel2
RIF.RISAF_DDR_Region1_Encrypted=true
RIF.RISAF_DDR_Region1_Secured=true
RIF.RISAF_DDR_Region3_Encrypted=true
RIF.RISAF_DDR_Region3_Secured=true
RIF.RISAF_DDR_Region7_Encrypted=true
RIF.RISAF_DDR_Region7_Secured=true
RIF.RISAF_DDR_Region8_Encrypted=true
RIF.RISAF_DDR_Region8_Secured=true
RIF.RISAF_DDR_Region9_Name=linuxkernel1
RIF.RISAF_DDR_Region_ID_10_Master_CID1_Read=true
RIF.RISAF_DDR_Region_ID_10_Master_CID1_Write=true
RIF.RISAF_DDR_Region_ID_10_Master_CID4_Read=true
RIF.RISAF_DDR_Region_ID_10_Master_CID4_Write=true
RIF.RISAF_DDR_Region_ID_13_Master_CID1_Read=true
RIF.RISAF_DDR_Region_ID_13_Master_CID1_Write=true
RIF.RISAF_DDR_Region_ID_13_Master_CID4_Read=true
RIF.RISAF_DDR_Region_ID_13_Master_CID4_Write=true
