STMicroelectronics/STM32_open_pin_data/boards/M33_Evaluation_Board_STM32MP257F-EV1_STM32MP257FAI_Board_AllConfig.ioc
RIF.RISAF_DDR_Region_ID_14_Master_CID1_Read=true
RIF.RISAF_DDR_Region_ID_14_Master_CID1_Write=true
RIF.RISAF_DDR_Region_ID_14_Master_CID4_Read=true
RIF.RISAF_DDR_Region_ID_14_Master_CID4_Write=true
RIF.RISAF_DDR_Region_ID_15_Master_CID1_Read=true
RIF.RISAF_DDR_Region_ID_15_Master_CID1_Write=true
RIF.RISAF_DDR_Region_ID_1_Master_CID2_Read=true
RIF.RISAF_DDR_Region_ID_1_Master_CID2_Write=true
RIF.RISAF_DDR_Region_ID_2_Master_CID2_Read=true
RIF.RISAF_DDR_Region_ID_2_Master_CID2_Write=true
RIF.RISAF_DDR_Region_ID_3_Master_CID2_Read=true
RIF.RISAF_DDR_Region_ID_3_Master_CID2_Write=true
RIF.RISAF_DDR_Region_ID_4_Master_CID2_Read=true
RIF.RISAF_DDR_Region_ID_4_Master_CID2_Write=true
RIF.RISAF_DDR_Region_ID_5_Master_CID1_Read=true
RIF.RISAF_DDR_Region_ID_5_Master_CID1_Write=true
RIF.RISAF_DDR_Region_ID_5_Master_CID2_Read=true
RIF.RISAF_DDR_Region_ID_5_Master_CID2_Write=true
RIF.RISAF_DDR_Region_ID_7_Master_CID0_Privilege=false
RIF.RISAF_DDR_Region_ID_7_Master_CID0_Read=false
RIF.RISAF_DDR_Region_ID_7_Master_CID0_Write=false
RIF.RISAF_DDR_Region_ID_7_Master_CID1_Privilege=true
RIF.RISAF_DDR_Region_ID_7_Master_CID1_Read=true
RIF.RISAF_DDR_Region_ID_7_Master_CID1_Write=true
RIF.RISAF_DDR_Region_ID_8_Master_CID0_Privilege=false
RIF.RISAF_DDR_Region_ID_8_Master_CID0_Read=false
RIF.RISAF_DDR_Region_ID_8_Master_CID0_Write=false
RIF.RISAF_DDR_Region_ID_8_Master_CID1_Read=true
RIF.RISAF_DDR_Region_ID_8_Master_CID1_Write=true
RIF.RISAF_DDR_Region_ID_9_Master_CID1_Read=true
RIF.RISAF_DDR_Region_ID_9_Master_CID1_Write=true
RIF.RISAF_DDR_Region_ID_9_Master_CID4_Read=true
RIF.RISAF_DDR_Region_ID_9_Master_CID4_Write=true
RIF.RISAF_OCTOSPI_Region1_Encrypted=false
RIF.RISAF_OCTOSPI_Region_ID_1_Master_CID0_Privilege=false
RIF.RISAF_OCTOSPI_Region_ID_1_Master_CID1_Privilege=false
RIF.RISAF_OCTOSPI_Region_ID_1_Master_CID2_Privilege=false
RIF.RISAF_OCTOSPI_Region_ID_2_Master_CID0_Privilege=false
RIF.RISAF_OCTOSPI_Region_ID_2_Master_CID1_Privilege=true
RIF.RISAF_OCTOSPI_Region_ID_2_Master_CID2_Privilege=false
RIF.RISAF_OCTOSPI_Region_ID_2_Master_CID2_Read=true
RIF.RISAF_OCTOSPI_Region_ID_2_Master_CID2_Write=true
RIF.RISAF_OCTOSPI_region1_Region_Size=0x0
RIF.RISAF_PCIE_Region_ID_1_Master_CID1_Read=true
RIF.RISAF_PCIE_Region_ID_1_Master_CID1_Write=true
RIF.RISUP.ADC12.Privilege=true
RIF.RISUP.COMBOPHY.Privilege=true
RIF.RISUP.CRYP1.Privilege=true
RIF.RISUP.CRYP2.Privilege=true
RIF.RISUP.CSI.Privilege=true
RIF.RISUP.DCMIPP.Privilege=true
RIF.RISUP.DSI_CMN.Privilege=true
RIF.RISUP.DSI_RDFIFO.Privilege=true
RIF.RISUP.DSI_TRIG.Privilege=true
RIF.RISUP.DTS.Privilege=true
RIF.RISUP.ETH1.Privilege=true
RIF.RISUP.ETH2.Privilege=true
RIF.RISUP.ETHSW_ACM_CFG.Privilege=true
RIF.RISUP.ETHSW_ACM_MSGBUF.Privilege=true
RIF.RISUP.ETHSW_DEIP.Privilege=true
RIF.RISUP.FDCAN.Privilege=true
RIF.RISUP.GICV2M.Privilege=true
RIF.RISUP.GPU.Privilege=true
RIF.RISUP.HASH.Lock=true
RIF.RISUP.HASH.Privilege=true
RIF.RISUP.I2C2.Privilege=true
RIF.RISUP.I2C7.Privilege=true
RIF.RISUP.I2C8.Privilege=true
RIF.RISUP.IAC.Privilege=true
RIF.RISUP.IWDG1.Lock=true
RIF.RISUP.IWDG1.Privilege=true
RIF.RISUP.IWDG2.Privilege=true
RIF.RISUP.IWDG3.Privilege=true
RIF.RISUP.LPTIM1.Privilege=true
RIF.RISUP.LPTIM2.Privilege=true
RIF.RISUP.LPTIM3.Privilege=true
RIF.RISUP.LPTIM4.Privilege=true
RIF.RISUP.LPTIM5.Privilege=true
RIF.RISUP.LPUART1.Privilege=true
RIF.RISUP.LTDC_CMN.Privilege=true
RIF.RISUP.LTDC_L0L1.Privilege=true
RIF.RISUP.LTDC_L2.Privilege=true
RIF.RISUP.LTDC_ROT.Privilege=true
RIF.RISUP.LVDS.Privilege=true
RIF.RISUP.MDF1.Privilege=true
RIF.RISUP.OCTOSPI2.Privilege=true
RIF.RISUP.OCTOSPIM.Privilege=true
RIF.RISUP.OTFDEC1.Privilege=true
RIF.RISUP.OTFDEC2.Privilege=true
RIF.RISUP.PCIE.Privilege=true
RIF.RISUP.PKA.Lock=true
RIF.RISUP.PKA.Privilege=true
RIF.RISUP.RAMCFG.Privilege=true
RIF.RISUP.RNG.Lock=true
RIF.RISUP.RNG.Privilege=true
RIF.RISUP.SAES.Lock=true
RIF.RISUP.SAES.Privilege=true
RIF.RISUP.SAI2.Privilege=true
RIF.RISUP.SDMMC1.Privilege=true
RIF.RISUP.SDMMC2.Privilege=true
RIF.RISUP.SDMMC3.Privilege=true
RIF.RISUP.SERC.Privilege=true
RIF.RISUP.SPI2.Privilege=true
RIF.RISUP.SPI3.Privilege=true
RIF.RISUP.SPI8.Privilege=true
RIF.RISUP.STGEN.Lock=true
RIF.RISUP.STGEN.Privilege=true
RIF.RISUP.TIM1.Privilege=true
RIF.RISUP.TIM10.Privilege=true
RIF.RISUP.TIM11.Privilege=true
RIF.RISUP.TIM12.Privilege=true
RIF.RISUP.TIM13.Privilege=true
RIF.RISUP.TIM14.Privilege=true
RIF.RISUP.TIM15.Privilege=true
RIF.RISUP.TIM16.Privilege=true
RIF.RISUP.TIM17.Privilege=true
RIF.RISUP.TIM20.Privilege=true
RIF.RISUP.TIM3.Privilege=true
RIF.RISUP.TIM4.Privilege=true
RIF.RISUP.TIM5.Privilege=true
RIF.RISUP.TIM6.Privilege=true
RIF.RISUP.TIM7.Privilege=true
RIF.RISUP.TIM8.Privilege=true
RIF.RISUP.USART2.Privilege=true
RIF.RISUP.USB3DR.Privilege=true
RIF.RISUP.USBH.Privilege=true
RIF.RISUP.VDEC.Privilege=true
RIF.RISUP.VENC.Privilege=true
RIF.RISUP.VREFBUF.Privilege=true
RIF.SDMMC1_CID_RIMU=1
RIF.SDMMC1_CID_RIMU-1=-
RIF.SDMMC1_Privilege_RIMU=true
RIF.SDMMC1_Privilege_RIMU-1=true
RIF.SDMMC2_CID_RIMU=0
RIF.SDMMC2_CID_RIMU-2=-
RIF.SDMMC2_Privilege_RIMU=true
RIF.SDMMC2_Privilege_RIMU-2=true
RIF.SDMMC3_CID_RIMU=0
RIF.SDMMC3_CID_RIMU-3=-
RIF.SDMMC3_Privilege_RIMU=true
RIF.SDMMC3_Privilege_RIMU-3=true
RIF.SRAM1_region1_CID_Filtering=true
RIF.SRAM1_region1_Master_CID1_Privilege=true
RIF.SRAM1_region1_Master_CID1_Read=true
RIF.SRAM1_region1_Master_CID1_Write=true
RIF.SRAM1_region1_Master_CID2_Privilege=true
RIF.SRAM1_region1_Master_CID2_Read=true
RIF.SRAM1_region1_priv=false
RIF.SRAM1_region1_secured=true
RIF.SRAM1_region2_CID_Filtering=true
RIF.SRAM1_region2_Master_CID2_Read=true
RIF.SRAM1_region2_Master_CID2_Write=true
RIF.SRAM1_region2_Region_Name=cm33_sram1
RIF.SRAM1_region2_priv=false
RIF.SRAM2_region1_CID_Filtering=true
RIF.SRAM2_region1_Master_CID2_Read=true
RIF.SRAM2_region1_Master_CID2_Write=true
RIF.SRAM2_region1_Region_Name=cm33_sram2
RIF.SRAM2_region1_priv=false
RIF.SYSRAM1_region1_CID_Filtering=true
RIF.SYSRAM1_region1_Master_CID1_Privilege=true
RIF.SYSRAM1_region1_Master_CID1_Read=true
RIF.SYSRAM1_region1_Master_CID1_Write=true
RIF.SYSRAM1_region1_Region_Name=tfa_bl31
RIF.SYSRAM1_region1_priv=false
RIF.SYSRAM1_region1_secured=true
RIF.SYSRAM2_region1_CID_Filtering=true
RIF.SYSRAM2_region1_Master_CID1_Privilege=true
RIF.SYSRAM2_region1_Master_CID1_Read=true
RIF.SYSRAM2_region1_Master_CID1_Write=true
RIF.USB3DR_CID_RIMU=1
RIF.USB3DR_CID_RIMU-4=-
RIF.USB3DR_Privilege_RIMU=true
RIF.USB3DR_Privilege_RIMU-4=true
RIF.USBH_CID_RIMU=1
RIF.USBH_CID_RIMU-5=-
RIF.USBH_Privilege_RIMU=true
RIF.USBH_Privilege_RIMU-5=true
RIF.VDEC_CID_RIMU=1
RIF.VDEC_CID_RIMU-14=-
RIF.VDEC_Privilege_RIMU=true
RIF.VDEC_Privilege_RIMU-14=true
RIF.VDERAM_region1_Region_Size=0x0
RIF.VDERAM_region2_CID_Filtering=true
RIF.VDERAM_region2_Master_CID1_Privilege=true
RIF.VDERAM_region2_Master_CID1_Read=true
RIF.VDERAM_region2_Master_CID1_Write=true
RIF.VDERAM_region2_Region_Name=ddr_param
RIF.VDERAM_region2_Region_Size=0x0
RIF.VDERAM_region2_priv=true
RIF.VDERAM_region2_secured=true
RIF.VDERAM_region3_Region_Size=0x0
RIF.VDERAM_region4_Region_Size=0x0
RIF.VDERAM_region5_Region_Size=0x0
RIF.VDERAM_region6_Region_Size=0x0
RIF.VENC_CID_RIMU=1
RIF.VENC_CID_RIMU-15=-
RIF.VENC_Privilege_RIMU=true
RIF.VENC_Privilege_RIMU-15=true
RIF.default_config=false
SH.GPXTI13.0=GPIO_EXTI1_13
SH.GPXTI13.ConfNb=1
SH.GPXTI2.0=GPIO_EXTI1_2
SH.GPXTI2.ConfNb=1
SH.GPXTI3.0=GPIO_EXTI1_3
SH.GPXTI3.ConfNb=1
SH.GPXTI4.0=GPIO_EXTI1_4
SH.GPXTI4.ConfNb=1
SH.GPXTI8.0=GPIO_EXTI1_8
SH.GPXTI8.ConfNb=1
SH.S_TIM8_CH1.0=TIM8_CH1,Input_Capture1_from_TI1
SH.S_TIM8_CH1.ConfNb=1
SH.S_TIM8_CH4.0=TIM8_CH4,Input_Capture4_from_TI4
SH.S_TIM8_CH4.ConfNb=1
SYS.userName=SYS_NS
TIM8.Channel-Input_Capture1_from_TI1=TIM_CHANNEL_1
TIM8.Channel-Input_Capture4_from_TI4=TIM_CHANNEL_4
TIM8.IPParameters=Channel-Input_Capture1_from_TI1,Channel-Input_Capture4_from_TI4
UCPD1_CC1.GPIOParameters=PinAttribute
UCPD1_CC1.Locked=true
UCPD1_CC1.Mode=Source_AllSignals
UCPD1_CC1.PinAttribute=CortexM33NS
UCPD1_CC1.Signal=UCPD1_CC1
UCPD1_CC2.GPIOParameters=PinAttribute
UCPD1_CC2.Locked=true
UCPD1_CC2.Mode=Source_AllSignals
UCPD1_CC2.PinAttribute=CortexM33NS
UCPD1_CC2.Signal=UCPD1_CC2
USART2.IPParameters=VirtualMode-Asynchronous
USART2.VirtualMode-Asynchronous=VM_ASYNC
USART6.IPParameters=VirtualMode-Asynchronous
USART6.VirtualMode-Asynchronous=VM_ASYNC
USB3DR_DM.GPIOParameters=PinAttribute
USB3DR_DM.Mode=Device_mode_USB2
USB3DR_DM.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
USB3DR_DM.Signal=USB3DR_DM
USB3DR_DP.GPIOParameters=PinAttribute
USB3DR_DP.Mode=Device_mode_USB2
USB3DR_DP.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
USB3DR_DP.Signal=USB3DR_DP
USB3DR_TXRTUNE.GPIOParameters=PinAttribute
USB3DR_TXRTUNE.Mode=Device_mode_USB2
USB3DR_TXRTUNE.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
USB3DR_TXRTUNE.Signal=USB3DR_TXRTUNE
USBH_HS_DM.GPIOParameters=PinAttribute
USBH_HS_DM.Locked=true
USBH_HS_DM.Mode=Enable
USBH_HS_DM.PinAttribute=CortexA35NSOS
USBH_HS_DM.Signal=USBH_HS_DM
USBH_HS_DP.GPIOParameters=PinAttribute
USBH_HS_DP.Locked=true
USBH_HS_DP.Mode=Enable
USBH_HS_DP.PinAttribute=CortexA35NSOS
USBH_HS_DP.Signal=USBH_HS_DP
USBH_HS_TXRTUNE.GPIOParameters=PinAttribute
USBH_HS_TXRTUNE.Locked=true
USBH_HS_TXRTUNE.Mode=Enable
USBH_HS_TXRTUNE.PinAttribute=CortexA35NSOS
USBH_HS_TXRTUNE.Signal=USBH_HS_TXRTUNE
VP_BSEC_VS_BSEC.Mode=BSEC_Activate
VP_BSEC_VS_BSEC.Signal=BSEC_VS_BSEC
VP_CORTEX_M33_VS_CORTEX_M33.Mode=CORTEX_M33_Activate
VP_CORTEX_M33_VS_CORTEX_M33.Signal=CORTEX_M33_VS_CORTEX_M33
VP_CRYP1_VS_CRYP.Mode=CRYP_Activate
VP_CRYP1_VS_CRYP.Signal=CRYP1_VS_CRYP
VP_DCMIPP_CSI.Mode=SerialInterface
VP_DCMIPP_CSI.Signal=DCMIPP_CSI
VP_DCMIPP_VS_PIPE0.Mode=Pipe 0
VP_DCMIPP_VS_PIPE0.Signal=DCMIPP_VS_PIPE0
VP_DDR_CTRL_PHY_DDR4.Mode=DDR4
VP_DDR_CTRL_PHY_DDR4.Signal=DDR_CTRL_PHY_DDR4
VP_DDR_CTRL_PHY_VS_16Gb.Mode=16Gb
VP_DDR_CTRL_PHY_VS_16Gb.Signal=DDR_CTRL_PHY_VS_16Gb
VP_DDR_CTRL_PHY_VS_32BITS.Mode=32bits
VP_DDR_CTRL_PHY_VS_32BITS.Signal=DDR_CTRL_PHY_VS_32BITS
VP_GPU_VS_GPU.Mode=GPU_Activate
VP_GPU_VS_GPU.Signal=GPU_VS_GPU
VP_HASH_VS_HASH.Mode=HASH_Activate
VP_HASH_VS_HASH.Signal=HASH_VS_HASH
VP_ICACHE_VS_SECURE_ICACHE_REG.Mode=ICACHE_REG_Not_Secured
VP_ICACHE_VS_SECURE_ICACHE_REG.Signal=ICACHE_VS_SECURE_ICACHE_REG
VP_IPCC1_VS_IPCC.Mode=IPCC_Activate
VP_IPCC1_VS_IPCC.Signal=IPCC1_VS_IPCC
VP_IWDG1_VS_IWDG.Mode=IWDG_Activate
VP_IWDG1_VS_IWDG.Signal=IWDG1_VS_IWDG
VP_LPTIM1_VS_LPTIM_counterModeInternalClock.Mode=Counts__internal_clock_event_00
VP_LPTIM1_VS_LPTIM_counterModeInternalClock.Signal=LPTIM1_VS_LPTIM_counterModeInternalClock
VP_LTDC_DSIMode.Mode=RGB888
VP_LTDC_DSIMode.Signal=LTDC_DSIMode
VP_OCTOSPI2_VS_dual.Mode=single_mode
VP_OCTOSPI2_VS_dual.Signal=OCTOSPI2_VS_dual
VP_OCTOSPIM_VS_IO.Mode=Swapped
VP_OCTOSPIM_VS_IO.Signal=OCTOSPIM_VS_IO
VP_PKA_VS_PKA.Mode=PKA_Activate
VP_PKA_VS_PKA.Signal=PKA_VS_PKA
VP_PWR_V_PVD_IN.Mode=Mode_PVD_Int
VP_PWR_V_PVD_IN.Signal=PWR_V_PVD_IN
VP_RNG_VS_RNG.Mode=RNG_Activate
VP_RNG_VS_RNG.Signal=RNG_VS_RNG
VP_RTC_VS_RTC_Activate.Mode=RTC_Enabled
VP_RTC_VS_RTC_Activate.Signal=RTC_VS_RTC_Activate
VP_RTC_VS_RTC_Calendar.Mode=RTC_Calendar
VP_RTC_VS_RTC_Calendar.Signal=RTC_VS_RTC_Calendar
VP_RTC_VS_RTC_WakeUp_intern.Mode=WakeUp
VP_RTC_VS_RTC_WakeUp_intern.Signal=RTC_VS_RTC_WakeUp_intern
VP_SAES_VS_SAES.Mode=SAES_Activate
VP_SAES_VS_SAES.Signal=SAES_VS_SAES
VP_SERC_VS_SERC.Mode=SERC_Activate
VP_SERC_VS_SERC.Signal=SERC_VS_SERC
VP_STGEN_VS_STGEN.Mode=STGEN_Activate
VP_STGEN_VS_STGEN.Signal=STGEN_VS_STGEN
VP_SYS_S_VS_Systick.Mode=SysTick
VP_SYS_S_VS_Systick.Signal=SYS_S_VS_Systick
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
VP_VDEC_VS_VDEC.Mode=VDEC_Activate
VP_VDEC_VS_VDEC.Signal=VDEC_VS_VDEC
VP_VENC_VS_VENC.Mode=VENC_Activate
VP_VENC_VS_VENC.Signal=VENC_VS_VENC
board=STM32MP257F-EV1
boardIOC=true
